Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 4 - GMII Address Register */
typedef struct _Ifx_ETH_GMII_ADDRESS_Bits
{
    unsigned int GB : 1;                      /**< \brief [0:0] GMII Busy (rw) */
    unsigned int GW : 1;                      /**< \brief [1:1] GMII Write (rw) */
    unsigned int CR : 4;                      /**< \brief [5:2] CSR Clock Range (rw) */
    unsigned int GR : 5;                      /**< \brief [10:6] GMII Register (rw) */
    unsigned int PA : 5;                      /**< \brief [15:11] Physical Layer Address (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_ETH_GMII_ADDRESS_Bits;

/** \brief  Register 5 - GMII Data Register */
typedef struct _Ifx_ETH_GMII_DATA_Bits
{
    unsigned int GD : 16;                     /**< \brief [15:0] GMII Data (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_ETH_GMII_DATA_Bits;

/** \brief  Input and Output Control Register */
typedef struct _Ifx_ETH_GPCTL_Bits
{
    unsigned int ALTI0 : 2;                   /**< \brief [1:0] Alternate Input Select (rw) */
    unsigned int ALTI1 : 2;                   /**< \brief [3:2] Alternate Input Select (rw) */
    unsigned int ALTI2 : 2;                   /**< \brief [5:4] Alternate Input Select (rw) */
    unsigned int ALTI3 : 2;                   /**< \brief [7:6] Alternate Input Select (rw) */
    unsigned int ALTI4 : 2;                   /**< \brief [9:8] Alternate Input Select (rw) */
    unsigned int ALTI5 : 2;                   /**< \brief [11:10] Alternate Input Select (rw) */
    unsigned int ALTI6 : 2;                   /**< \brief [13:12] Alternate Input Select (rw) */
    unsigned int ALTI7 : 2;                   /**< \brief [15:14] Alternate Input Select (rw) */
    unsigned int ALTI8 : 2;                   /**< \brief [17:16] Alternate Input Select (rw) */
    unsigned int ALTI9 : 2;                   /**< \brief [19:18] Alternate Input Select (rw) */
    unsigned int ALTI10 : 2;                  /**< \brief [21:20] Alternate Input Select (rw) */
    unsigned int reserved_22 : 2;             /**< \brief \internal Reserved */
    unsigned int EPR : 1;                     /**< \brief [24:24] External Phy Interface RMMI Mode Bit (rw) */
    unsigned int reserved_25 : 6;             /**< \brief \internal Reserved */
    unsigned int TCEN : 1;                    /**< \brief [31:31] Test Clock Enable (rw) */
} Ifx_ETH_GPCTL_Bits;

/** \brief  Register 2 - Hash Table High Register */
typedef struct _Ifx_ETH_HASH_TABLE_HIGH_Bits
{
    unsigned int HTH : 32;                    /**< \brief [31:0] Hash Table High (rw) */
} Ifx_ETH_HASH_TABLE_HIGH_Bits;

/** \brief  Register 3 - Hash Table Low Register */
typedef struct _Ifx_ETH_HASH_TABLE_LOW_Bits
{
    unsigned int HTL : 32;                    /**< \brief [31:0] Hash Table Low (rw) */
} Ifx_ETH_HASH_TABLE_LOW_Bits;

/** \brief  Register 22 - HW Feature Register */
typedef struct _Ifx_ETH_HW_FEATURE_Bits
{
    unsigned int MIISEL : 1;                  /**< \brief [0:0] MIISEL (r) */
    unsigned int GMIISEL : 1;                 /**< \brief [1:1] GMIISEL (r) */
    unsigned int HDSEL : 1;                   /**< \brief [2:2] HDSEL (r) */
    unsigned int EXTHASHEN : 1;               /**< \brief [3:3] EXTHASHEN (r) */
    unsigned int HASHSEL : 1;                 /**< \brief [4:4] HASHSEL (r) */
    unsigned int ADDMACADRSEL : 1;            /**< \brief [5:5] ADDMACADRSEL (r) */
    unsigned int PCSSEL : 1;                  /**< \brief [6:6] PCSSEL (r) */
    unsigned int L3L4FLTREN : 1;              /**< \brief [7:7] L3L4FLTREN (r) */
    unsigned int SMASEL : 1;                  /**< \brief [8:8] SMASEL (r) */
    unsigned int RWKSEL : 1;                  /**< \brief [9:9] RWKSEL (r) */
    unsigned int MGKSEL : 1;                  /**< \brief [10:10] MGKSEL (r) */
    unsigned int MMCSEL : 1;                  /**< \brief [11:11] MMCSEL (r) */
    unsigned int TSVER1SEL : 1;               /**< \brief [12:12] TSVER1SEL (r) */
    unsigned int TSVER2SEL : 1;               /**< \brief [13:13] TSVER2SEL (r) */
    unsigned int EEESEL : 1;                  /**< \brief [14:14] EEESEL (r) */
    unsigned int AVSEL : 1;                   /**< \brief [15:15] AVSEL (r) */
    unsigned int TXCOESEL : 1;                /**< \brief [16:16] TXCOESEL (r) */
    unsigned int RXTYP1COE : 1;               /**< \brief [17:17] RXTYP1COE (r) */
    unsigned int RXTYP2COE : 1;               /**< \brief [18:18] RXTYP2COE (r) */
    unsigned int RXFIFOSIZE : 1;              /**< \brief [19:19] RXFIFOSIZE (rw) */
    unsigned int RXCHCNT : 2;                 /**< \brief [21:20] RXCHCNT (r) */
    unsigned int TXCHCNT : 2;                 /**< \brief [23:22] TXCHCNT (r) */
    unsigned int ENHDESSEL : 1;               /**< \brief [24:24] ENHDESSEL (r) */
    unsigned int INTTSEN : 1;                 /**< \brief [25:25] INTTSEN (r) */
    unsigned int FLEXIPPSEN : 1;              /**< \brief [26:26] FLEXIPPSEN (r) */
    unsigned int SAVLANINS : 1;               /**< \brief [27:27] SAVLANINS (r) */
    unsigned int ACTPHYIF : 3;                /**< \brief [30:28] Active or Selected PHY interface (r) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_ETH_HW_FEATURE_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_ETH_ID_Bits
{
    unsigned int MODREV : 8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE : 8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER : 16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_ETH_ID_Bits;

/** \brief  Register 7 - Interrupt Enable Register */
typedef struct _Ifx_ETH_INTERRUPT_ENABLE_Bits
{
    unsigned int TIE : 1;                     /**< \brief [0:0] Transmit Interrupt Enable (rw) */
    unsigned int TSE : 1;                     /**< \brief [1:1] Transmit Stopped Enable (rw) */
    unsigned int TUE : 1;                     /**< \brief [2:2] Transmit Buffer Unvailable Enable (rw) */
    unsigned int TJE : 1;                     /**< \brief [3:3] Transmit Jabber Timeout Enable (rw) */
    unsigned int OVE : 1;                     /**< \brief [4:4] Overflow Interrupt Enable (rw) */
    unsigned int UNE : 1;                     /**< \brief [5:5] Underflow Interrupt Enable (rw) */
    unsigned int RIE : 1;                     /**< \brief [6:6] Receive Interrupt Enable (rw) */
    unsigned int RUE : 1;                     /**< \brief [7:7] Receive Buffer Unavailable Enable (rw) */
    unsigned int RSE : 1;                     /**< \brief [8:8] Receive Stopped Enable (rw) */
    unsigned int RWE : 1;                     /**< \brief [9:9] Receive Watchdog Timeout Enable (rw) */
    unsigned int ETE : 1;                     /**< \brief [10:10] Early Transmit Interrupt Enable (rw) */
    unsigned int reserved_11 : 2;             /**< \brief \internal Reserved */
    unsigned int FBE : 1;                     /**< \brief [13:13] Fatal Bus Error Enable (rw) */
    unsigned int ERE : 1;                     /**< \brief [14:14] Early Receive Interrupt Enable (rw) */
    unsigned int AIE : 1;                     /**< \brief [15:15] Abnormal Interrupt Summary Enable (rw) */
    unsigned int NIE : 1;                     /**< \brief [16:16] Normal Interrupt Summary Enable (rw) */
    unsigned int reserved_17 : 15;            /**< \brief \internal Reserved */
} Ifx_ETH_INTERRUPT_ENABLE_Bits;

/** \brief  Register 15 - Interrupt Mask Register */
typedef struct _Ifx_ETH_INTERRUPT_MASK_Bits
{
    unsigned int RGSMIIIM : 1;                /**< \brief [0:0] RGMII or SMII Interrupt Mask (r) */
    unsigned int PCSLCHGIM : 1;               /**< \brief [1:1] PCS Link Status Interrupt Mask (r) */
    unsigned int PCSANCIM : 1;                /**< \brief [2:2] PCS AN Completion Interrupt Mask (r) */
    unsigned int PMTIM : 1;                   /**< \brief [3:3] PMT Interrupt Mask (rw) */
    unsigned int reserved_4 : 5;              /**< \brief \internal Reserved */
    unsigned int TSIM : 1;                    /**< \brief [9:9] Timestamp Interrupt Mask (rw) */
    unsigned int LPIIM : 1;                   /**< \brief [10:10] LPI Interrupt Mask (r) */
    unsigned int reserved_11 : 21;            /**< \brief \internal Reserved */
} Ifx_ETH_INTERRUPT_MASK_Bits;

/** \brief  Register 14 - Interrupt Register */
typedef struct _Ifx_ETH_INTERRUPT_STATUS_Bits
{
    unsigned int RGSMIIIS : 1;                /**< \brief [0:0] RGMII or SMII Interrupt Status (r) */
    unsigned int PCSLCHGIS : 1;               /**< \brief [1:1] PCS Link Status Changed (r) */
    unsigned int PCSANCIS : 1;                /**< \brief [2:2] PCS Auto-Negotiation Complete (r) */
    unsigned int PMTIS : 1;                   /**< \brief [3:3] PMT Interrupt Status (r) */
    unsigned int MMCIS : 1;                   /**< \brief [4:4] MMC Interrupt Status (r) */
    unsigned int MMCRXIS : 1;                 /**< \brief [5:5] MMC Receive Interrupt Status (r) */
    unsigned int MMCTXIS : 1;                 /**< \brief [6:6] MMC Transmit Interrupt Status (r) */
    unsigned int MMCRXIPIS : 1;               /**< \brief [7:7] MMC Receive Checksum Offload Interrupt Status (r) */
    unsigned int reserved_8 : 1;              /**< \brief \internal Reserved */
    unsigned int TSIS : 1;                    /**< \brief [9:9] Timestamp Interrupt Status (r) */
    unsigned int LPIIS : 1;                   /**< \brief [10:10] LPI Interrupt Status (r) */
    unsigned int reserved_11 : 21;            /**< \brief \internal Reserved */
} Ifx_ETH_INTERRUPT_STATUS_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_ETH_KRST0_Bits
{
    unsigned int RST : 1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT : 1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2 : 30;             /**< \brief \internal Reserved */
} Ifx_ETH_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_ETH_KRST1_Bits
{
    unsigned int RST : 1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1 : 31;             /**< \brief \internal Reserved */
} Ifx_ETH_KRST1_Bits;

