Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_ETH_KRSTCLR_Bits
{
    unsigned int CLR : 1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1 : 31;             /**< \brief \internal Reserved */
} Ifx_ETH_KRSTCLR_Bits;

/** \brief  MAC Address High Register */
typedef struct _Ifx_ETH_MAC_ADDRESS_HIGH_Bits
{
    unsigned int ADDRHI : 16;                 /**< \brief [15:0]  (rw) */
    unsigned int reserved_16 : 8;             /**< \brief \internal Reserved */
    unsigned int MBC : 6;                     /**< \brief [29:24]  (rw) */
    unsigned int SA : 1;                      /**< \brief [30:30]  (rw) */
    unsigned int AE : 1;                      /**< \brief [31:31]  (rw) */
} Ifx_ETH_MAC_ADDRESS_HIGH_Bits;

/** \brief  MAC Address Low Register */
typedef struct _Ifx_ETH_MAC_ADDRESS_LOW_Bits
{
    unsigned int ADDRLO : 32;                 /**< \brief [31:0]  (rw) */
} Ifx_ETH_MAC_ADDRESS_LOW_Bits;

/** \brief  Register 0 - MAC Configuration Register */
typedef struct _Ifx_ETH_MAC_CONFIGURATION_Bits
{
    unsigned int PRELEN : 2;                  /**< \brief [1:0] Preamble Length for Transmit Frames (rw) */
    unsigned int RE : 1;                      /**< \brief [2:2] Receiver Enable (rw) */
    unsigned int TE : 1;                      /**< \brief [3:3] Transmitter Enable (rw) */
    unsigned int DC : 1;                      /**< \brief [4:4] Deferral Check (rw) */
    unsigned int BL : 2;                      /**< \brief [6:5] Back-Off Limit (rw) */
    unsigned int ACS : 1;                     /**< \brief [7:7] Automatic Pad or CRC Stripping (rw) */
    unsigned int LUD : 1;                     /**< \brief [8:8] Link Up or Down (r) */
    unsigned int DR : 1;                      /**< \brief [9:9] Disable Retry (rw) */
    unsigned int IPC : 1;                     /**< \brief [10:10] Checksum Offload (rw) */
    unsigned int DM : 1;                      /**< \brief [11:11] Duplex Mode (rw) */
    unsigned int LM : 1;                      /**< \brief [12:12] Loopback Mode (rw) */
    unsigned int DO : 1;                      /**< \brief [13:13] Disable Receive Own (rw) */
    unsigned int FES : 1;                     /**< \brief [14:14] Speed (rw) */
    unsigned int PS : 1;                      /**< \brief [15:15] Port Select (r) */
    unsigned int DCRS : 1;                    /**< \brief [16:16] Disable Carrier Sense During Transmission (rw) */
    unsigned int IFG : 3;                     /**< \brief [19:17] Inter-Frame Gap (rw) */
    unsigned int JE : 1;                      /**< \brief [20:20] Jumbo Frame Enable (rw) */
    unsigned int BE : 1;                      /**< \brief [21:21] Frame Burst Enable (r) */
    unsigned int JD : 1;                      /**< \brief [22:22] Jabber Disable (rw) */
    unsigned int WD : 1;                      /**< \brief [23:23] Watchdog Disable (rw) */
    unsigned int TC : 1;                      /**< \brief [24:24] Transmit Configuration in RGMII, SGMII, or SMII (r) */
    unsigned int CST : 1;                     /**< \brief [25:25] CRC Stripping of Type Frames (rw) */
    unsigned int SFTERR : 1;                  /**< \brief [26:26] SMII Force Transmit Error (r) */
    unsigned int TWOKPE : 1;                  /**< \brief [27:27] IEEE 802.3as support for 2K packets Enable (rw) */
    unsigned int reserved_28 : 4;             /**< \brief \internal Reserved */
} Ifx_ETH_MAC_CONFIGURATION_Bits;

/** \brief  Register 1 - MAC Frame Filter */
typedef struct _Ifx_ETH_MAC_FRAME_FILTER_Bits
{
    unsigned int PR : 1;                      /**< \brief [0:0] Promiscuous Mode (rw) */
    unsigned int HUC : 1;                     /**< \brief [1:1] Hash Unicast (rw) */
    unsigned int HMC : 1;                     /**< \brief [2:2] Hash Multicast (rw) */
    unsigned int DAIF : 1;                    /**< \brief [3:3] DA Inverse Filtering (rw) */
    unsigned int PM : 1;                      /**< \brief [4:4] Pass All Multicast (rw) */
    unsigned int DBF : 1;                     /**< \brief [5:5] Disable Broadcast Frames (rw) */
    unsigned int PCF : 2;                     /**< \brief [7:6] Pass Control Frames (rw) */
    unsigned int SAIF : 1;                    /**< \brief [8:8] SA Inverse Filtering (rw) */
    unsigned int SAF : 1;                     /**< \brief [9:9] Source Address Filter Enable (rw) */
    unsigned int HPF : 1;                     /**< \brief [10:10] Hash or Perfect Filter (rw) */
    unsigned int reserved_11 : 5;             /**< \brief \internal Reserved */
    unsigned int VTFE : 1;                    /**< \brief [16:16] VLAN Tag Filter Enable (rw) */
    unsigned int reserved_17 : 3;             /**< \brief \internal Reserved */
    unsigned int IPFE : 1;                    /**< \brief [20:20] Layer 3 and Layer 4 Filter Enable (r) */
    unsigned int DNTU : 1;                    /**< \brief [21:21] Drop non-TCP/UDP over IP Frames (r) */
    unsigned int reserved_22 : 9;             /**< \brief \internal Reserved */
    unsigned int RA : 1;                      /**< \brief [31:31] Receive All (rw) */
} Ifx_ETH_MAC_FRAME_FILTER_Bits;

/** \brief  Register 8 - Missed Frame and Buffer Overflow Counter Register */
typedef struct _Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits
{
    unsigned int MISFRMCNT : 16;              /**< \brief [15:0] MISFRMCNT (r) */
    unsigned int MISCNTOVF : 1;               /**< \brief [16:16] MISCNTOVF (r) */
    unsigned int OVFFRMCNT : 11;              /**< \brief [27:17] OVFFRMCNT (r) */
    unsigned int OVFCNTOVF : 1;               /**< \brief [28:28] OVFCNTOVF (r) */
    unsigned int reserved_29 : 3;             /**< \brief \internal Reserved */
} Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits;

/** \brief  Register 64 - MMC Control Register */
typedef struct _Ifx_ETH_MMC_CONTROL_Bits
{
    unsigned int CNTRST : 1;                  /**< \brief [0:0] Counters Reset (rw) */
    unsigned int CNTSTOPRO : 1;               /**< \brief [1:1] Counters Stop Rollover (rw) */
    unsigned int RSTONRD : 1;                 /**< \brief [2:2] Reset on Read (rw) */
    unsigned int CNTFREEZ : 1;                /**< \brief [3:3] MMC Counter Freeze (rw) */
    unsigned int CNTPRST : 1;                 /**< \brief [4:4] Counters Preset (rw) */
    unsigned int CNTPRSTLVL : 1;              /**< \brief [5:5] Full-Half Preset (rw) */
    unsigned int reserved_6 : 2;              /**< \brief \internal Reserved */
    unsigned int UCDBC : 1;                   /**< \brief [8:8] Update MMC Counters for Dropped Broadcast Frames (rw) */
    unsigned int reserved_9 : 23;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_CONTROL_Bits;

