Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 130 - MMC Receive Checksum Offload Interrupt Register */
typedef struct _Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits
{
    unsigned int RXIPV4GFIS : 1;              /**< \brief [0:0] MMC Receive IPV4 Good Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4HERFIS : 1;            /**< \brief [1:1] MMC Receive IPV4 Header Error Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4NOPAYFIS : 1;          /**< \brief [2:2] MMC Receive IPV4 No Payload Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4FRAGFIS : 1;           /**< \brief [3:3] MMC Receive IPV4 Fragmented Frame Counter Interrupt Status (r) */
    unsigned int RXIPV4UDSBLFIS : 1;          /**< \brief [4:4] MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6GFIS : 1;              /**< \brief [5:5] MMC Receive IPV6 Good Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6HERFIS : 1;            /**< \brief [6:6] MMC Receive IPV6 Header Error Frame Counter Interrupt Status (r) */
    unsigned int RXIPV6NOPAYFIS : 1;          /**< \brief [7:7] MMC Receive IPV6 No Payload Frame Counter Interrupt Status (r) */
    unsigned int RXUDPGFIS : 1;               /**< \brief [8:8] MMC Receive UDP Good Frame Counter Interrupt Status (r) */
    unsigned int RXUDPERFIS : 1;              /**< \brief [9:9] MMC Receive UDP Error Frame Counter Interrupt Status (r) */
    unsigned int RXTCPGFIS : 1;               /**< \brief [10:10] MMC Receive TCP Good Frame Counter Interrupt Status (r) */
    unsigned int RXTCPERFIS : 1;              /**< \brief [11:11] MMC Receive TCP Error Frame Counter Interrupt Status (r) */
    unsigned int RXICMPGFIS : 1;              /**< \brief [12:12] MMC Receive ICMP Good Frame Counter Interrupt Status (r) */
    unsigned int RXICMPERFIS : 1;             /**< \brief [13:13] MMC Receive ICMP Error Frame Counter Interrupt Status (r) */
    unsigned int reserved_14 : 2;             /**< \brief \internal Reserved */
    unsigned int RXIPV4GOIS : 1;              /**< \brief [16:16] MMC Receive IPV4 Good Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4HEROIS : 1;            /**< \brief [17:17] MMC Receive IPV4 Header Error Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4NOPAYOIS : 1;          /**< \brief [18:18] MMC Receive IPV4 No Payload Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4FRAGOIS : 1;           /**< \brief [19:19] MMC Receive IPV4 Fragmented Octet Counter Interrupt Status (r) */
    unsigned int RXIPV4UDSBLOIS : 1;          /**< \brief [20:20] MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6GOIS : 1;              /**< \brief [21:21] MMC Receive IPV6 Good Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6HEROIS : 1;            /**< \brief [22:22] MMC Receive IPV6 Header Error Octet Counter Interrupt Status (r) */
    unsigned int RXIPV6NOPAYOIS : 1;          /**< \brief [23:23] MMC Receive IPV6 No Payload Octet Counter Interrupt Status (r) */
    unsigned int RXUDPGOIS : 1;               /**< \brief [24:24] MMC Receive UDP Good Octet Counter Interrupt Status (r) */
    unsigned int RXUDPEROIS : 1;              /**< \brief [25:25] MMC Receive UDP Error Octet Counter Interrupt Status (r) */
    unsigned int RXTCPGOIS : 1;               /**< \brief [26:26] MMC Receive TCP Good Octet Counter Interrupt Status (r) */
    unsigned int RXTCPEROIS : 1;              /**< \brief [27:27] MMC Receive TCP Error Octet Counter Interrupt Status (r) */
    unsigned int RXICMPGOIS : 1;              /**< \brief [28:28] MMC Receive ICMP Good Octet Counter Interrupt Status (r) */
    unsigned int RXICMPEROIS : 1;             /**< \brief [29:29] MMC Receive ICMP Error Octet Counter Interrupt Status (r) */
    unsigned int reserved_30 : 2;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits;

/** \brief  Register 128 - MMC Receive Checksum Offload Interrupt Mask Register */
typedef struct _Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits
{
    unsigned int RXIPV4GFIM : 1;              /**< \brief [0:0] MMC Receive IPV4 Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4HERFIM : 1;            /**< \brief [1:1] MMC Receive IPV4 Header Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4NOPAYFIM : 1;          /**< \brief [2:2] MMC Receive IPV4 No Payload Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4FRAGFIM : 1;           /**< \brief [3:3] MMC Receive IPV4 Fragmented Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV4UDSBLFIM : 1;          /**< \brief [4:4] MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6GFIM : 1;              /**< \brief [5:5] MMC Receive IPV6 Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6HERFIM : 1;            /**< \brief [6:6] MMC Receive IPV6 Header Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXIPV6NOPAYFIM : 1;          /**< \brief [7:7] MMC Receive IPV6 No Payload Frame Counter Interrupt Mask (rw) */
    unsigned int RXUDPGFIM : 1;               /**< \brief [8:8] MMC Receive UDP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXUDPERFIM : 1;              /**< \brief [9:9] MMC Receive UDP Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXTCPGFIM : 1;               /**< \brief [10:10] MMC Receive TCP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXTCPERFIM : 1;              /**< \brief [11:11] MMC Receive TCP Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXICMPGFIM : 1;              /**< \brief [12:12] MMC Receive ICMP Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXICMPERFIM : 1;             /**< \brief [13:13] MMC Receive ICMP Error Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_14 : 2;             /**< \brief \internal Reserved */
    unsigned int RXIPV4GOIM : 1;              /**< \brief [16:16] MMC Receive IPV4 Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4HEROIM : 1;            /**< \brief [17:17] MMC Receive IPV4 Header Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4NOPAYOIM : 1;          /**< \brief [18:18] MMC Receive IPV4 No Payload Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4FRAGOIM : 1;           /**< \brief [19:19] MMC Receive IPV4 Fragmented Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV4UDSBLOIM : 1;          /**< \brief [20:20] MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6GOIM : 1;              /**< \brief [21:21] MMC Receive IPV6 Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6HEROIM : 1;            /**< \brief [22:22] MMC Receive IPV6 Header Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXIPV6NOPAYOIM : 1;          /**< \brief [23:23] MMC Receive IPV6 No Payload Octet Counter Interrupt Mask (rw) */
    unsigned int RXUDPGOIM : 1;               /**< \brief [24:24] MMC Receive UDP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXUDPEROIM : 1;              /**< \brief [25:25] MMC Receive UDP Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXTCPGOIM : 1;               /**< \brief [26:26] MMC Receive TCP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXTCPEROIM : 1;              /**< \brief [27:27] MMC Receive TCP Error Octet Counter Interrupt Mask (rw) */
    unsigned int RXICMPGOIM : 1;              /**< \brief [28:28] MMC Receive ICMP Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXICMPEROIM : 1;             /**< \brief [29:29] MMC Receive ICMP Error Octet Counter Interrupt Mask (rw) */
    unsigned int reserved_30 : 2;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits;

/** \brief  Register 65 - MMC Receive Interrupt Register */
typedef struct _Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits
{
    unsigned int RXGBFRMIS : 1;               /**< \brief [0:0] MMC Receive Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXGBOCTIS : 1;               /**< \brief [1:1] MMC Receive Good Bad Octet Counter Interrupt Status (r) */
    unsigned int RXGOCTIS : 1;                /**< \brief [2:2] MMC Receive Good Octet Counter Interrupt Status. (r) */
    unsigned int RXBCGFIS : 1;                /**< \brief [3:3] MMC Receive Broadcast Good Frame Counter Interrupt Status. (r) */
    unsigned int RXMCGFIS : 1;                /**< \brief [4:4] MMC Receive Multicast Good Frame Counter Interrupt Status (r) */
    unsigned int RXCRCERFIS : 1;              /**< \brief [5:5] MMC Receive CRC Error Frame Counter Interrupt Status (r) */
    unsigned int RXALGNERFIS : 1;             /**< \brief [6:6] MMC Receive Alignment Error Frame Counter Interrupt Status (r) */
    unsigned int RXRUNTFIS : 1;               /**< \brief [7:7] MMC Receive Runt Frame Counter Interrupt Status (r) */
    unsigned int RXJABERFIS : 1;              /**< \brief [8:8] MMC Receive Jabber Error Frame Counter Interrupt Status (r) */
    unsigned int RXUSIZEGFIS : 1;             /**< \brief [9:9] MMC Receive Undersize Good Frame Counter Interrupt Status (r) */
    unsigned int RXOSIZEGFIS : 1;             /**< \brief [10:10] MMC Receive Oversize Good Frame Counter Interrupt Status (r) */
    unsigned int RX64OCTGBFIS : 1;            /**< \brief [11:11] MMC Receive 64 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX65T127OCTGBFIS : 1;        /**< \brief [12:12] MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX128T255OCTGBFIS : 1;       /**< \brief [13:13] MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX256T511OCTGBFIS : 1;       /**< \brief [14:14] MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX512T1023OCTGBFIS : 1;      /**< \brief [15:15] MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RX1024TMAXOCTGBFIS : 1;      /**< \brief [16:16] MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXUCGFIS : 1;                /**< \brief [17:17] MMC Receive Unicast Good Frame Counter Interrupt Status (r) */
    unsigned int RXLENERFIS : 1;              /**< \brief [18:18] MMC Receive Length Error Frame Counter Interrupt Status (r) */
    unsigned int RXORANGEFIS : 1;             /**< \brief [19:19] MMC Receive Out Of Range Error Frame Counter Interrupt Status (r) */
    unsigned int RXPAUSFIS : 1;               /**< \brief [20:20] MMC Receive Pause Frame Counter Interrupt Status (r) */
    unsigned int RXFOVFIS : 1;                /**< \brief [21:21] MMC Receive FIFO Overflow Frame Counter Interrupt Status (r) */
    unsigned int RXVLANGBFIS : 1;             /**< \brief [22:22] MMC Receive VLAN Good Bad Frame Counter Interrupt Status (r) */
    unsigned int RXWDOGFIS : 1;               /**< \brief [23:23] MMC Receive Watchdog Error Frame Counter Interrupt Status (r) */
    unsigned int RXRCVERRFIS : 1;             /**< \brief [24:24] MMC Receive Error Frame Counter Interrupt Status (r) */
    unsigned int RXCTRLFIS : 1;               /**< \brief [25:25] MMC Receive Control Frame Counter Interrupt Status (r) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits;

/** \brief  - */
typedef struct _Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits
{
    unsigned int RXGBFRMIM : 1;               /**< \brief [0:0] MMC Receive Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXGBOCTIM : 1;               /**< \brief [1:1] MMC Receive Good Bad Octet Counter Interrupt Mask (rw) */
    unsigned int RXGOCTIM : 1;                /**< \brief [2:2] MMC Receive Good Octet Counter Interrupt Mask (rw) */
    unsigned int RXBCGFIM : 1;                /**< \brief [3:3] MMC Receive Broadcast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXMCGFIM : 1;                /**< \brief [4:4] MMC Receive Multicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXCRCERFIM : 1;              /**< \brief [5:5] MMC Receive CRC Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXALGNERFIM : 1;             /**< \brief [6:6] MMC Receive Alignment Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXRUNTFIM : 1;               /**< \brief [7:7] MMC Receive Runt Frame Counter Interrupt Mask (rw) */
    unsigned int RXJABERFIM : 1;              /**< \brief [8:8] MMC Receive Jabber Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXUSIZEGFIM : 1;             /**< \brief [9:9] MMC Receive Undersize Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXOSIZEGFIM : 1;             /**< \brief [10:10] MMC Receive Oversize Good Frame Counter Interrupt Mask (rw) */
    unsigned int RX64OCTGBFIM : 1;            /**< \brief [11:11] MMC Receive 64 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX65T127OCTGBFIM : 1;        /**< \brief [12:12] MMC Receive 65 to 127 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX128T255OCTGBFIM : 1;       /**< \brief [13:13] MMC Receive 128 to 255 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX256T511OCTGBFIM : 1;       /**< \brief [14:14] MMC Receive 256 to 511 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX512T1023OCTGBFIM : 1;      /**< \brief [15:15] MMC Receive 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RX1024TMAXOCTGBFIM : 1;      /**< \brief [16:16] MMC Receive 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXUCGFIM : 1;                /**< \brief [17:17] MMC Receive Unicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int RXLENERFIM : 1;              /**< \brief [18:18] MMC Receive Length Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXORANGEFIM : 1;             /**< \brief [19:19] MMC Receive Out Of Range Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXPAUSFIM : 1;               /**< \brief [20:20] MMC Receive Pause Frame Counter Interrupt Mask (rw) */
    unsigned int RXFOVFIM : 1;                /**< \brief [21:21] MMC Receive FIFO Overflow Frame Counter Interrupt Mask (rw) */
    unsigned int RXVLANGBFIM : 1;             /**< \brief [22:22] MMC Receive VLAN Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int RXWDOGFIM : 1;               /**< \brief [23:23] MMC Receive Watchdog Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXRCVERRFIM : 1;             /**< \brief [24:24] MMC Receive Error Frame Counter Interrupt Mask (rw) */
    unsigned int RXCTRLFIM : 1;               /**< \brief [25:25] MMC Receive Control Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits;

/** \brief  Register 66 - MMC Transmit Interrupt Register */
typedef struct _Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits
{
    unsigned int TXGBOCTIS : 1;               /**< \brief [0:0] MMC Transmit Good Bad Octet Counter Interrupt Status (r) */
    unsigned int TXGBFRMIS : 1;               /**< \brief [1:1] MMC Transmit Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXBCGFIS : 1;                /**< \brief [2:2] MMC Transmit Broadcast Good Frame Counter Interrupt Status (r) */
    unsigned int TXMCGFIS : 1;                /**< \brief [3:3] MMC Transmit Multicast Good Frame Counter Interrupt Status (r) */
    unsigned int TX64OCTGBFIS : 1;            /**< \brief [4:4] MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Status. (r) */
    unsigned int TX65T127OCTGBFIS : 1;        /**< \brief [5:5] MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX128T255OCTGBFIS : 1;       /**< \brief [6:6] MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX256T511OCTGBFIS : 1;       /**< \brief [7:7] MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX512T1023OCTGBFIS : 1;      /**< \brief [8:8] MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TX1024TMAXOCTGBFIS : 1;      /**< \brief [9:9] MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXUCGBFIS : 1;               /**< \brief [10:10] MMC Transmit Unicast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXMCGBFIS : 1;               /**< \brief [11:11] MMC Transmit Multicast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXBCGBFIS : 1;               /**< \brief [12:12] MMC Transmit Broadcast Good Bad Frame Counter Interrupt Status (r) */
    unsigned int TXUFLOWERFIS : 1;            /**< \brief [13:13] MMC Transmit Underflow Error Frame Counter Interrupt Status (r) */
    unsigned int TXSCOLGFIS : 1;              /**< \brief [14:14] MMC Transmit Single Collision Good Frame Counter Interrupt Status (r) */
    unsigned int TXMCOLGFIS : 1;              /**< \brief [15:15] MMC Transmit Multiple Collision Good Frame Counter Interrupt Status (r) */
    unsigned int TXDEFFIS : 1;                /**< \brief [16:16] MMC Transmit Deferred Frame Counter Interrupt Status (r) */
    unsigned int TXLATCOLFIS : 1;             /**< \brief [17:17] MMC Transmit Late Collision Frame Counter Interrupt Status (r) */
    unsigned int TXEXCOLFIS : 1;              /**< \brief [18:18] MMC Transmit Excessive Collision Frame Counter Interrupt Status (r) */
    unsigned int TXCARERFIS : 1;              /**< \brief [19:19] MMC Transmit Carrier Error Frame Counter Interrupt Status (r) */
    unsigned int TXGOCTIS : 1;                /**< \brief [20:20] MMC Transmit Good Octet Counter Interrupt Status (r) */
    unsigned int TXGFRMIS : 1;                /**< \brief [21:21] MMC Transmit Good Frame Counter Interrupt Status (r) */
    unsigned int TXEXDEFFIS : 1;              /**< \brief [22:22] MMC Transmit Excessive Deferral Frame Counter Interrupt Status (r) */
    unsigned int TXPAUSFIS : 1;               /**< \brief [23:23] MMC Transmit Pause Frame Counter Interrupt Status (r) */
    unsigned int TXVLANGFIS : 1;              /**< \brief [24:24] MMC Transmit VLAN Good Frame Counter Interrupt Status (r) */
    unsigned int TXOSIZEGFIS : 1;             /**< \brief [25:25] MMC Transmit Oversize Good Frame Counter Interrupt Status (r) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits;

/** \brief  Register 68 - MMC Transmit Interrupt Mask Register */
typedef struct _Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits
{
    unsigned int TXGBOCTIM : 1;               /**< \brief [0:0] MMC Transmit Good Bad Octet Counter Interrupt Mask (rw) */
    unsigned int TXGBFRMIM : 1;               /**< \brief [1:1] MMC Transmit Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXBCGFIM : 1;                /**< \brief [2:2] MMC Transmit Broadcast Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCGFIM : 1;                /**< \brief [3:3] MMC Transmit Multicast Good Frame Counter Interrupt Mask (rw) */
    unsigned int TX64OCTGBFIM : 1;            /**< \brief [4:4] MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX65T127OCTGBFIM : 1;        /**< \brief [5:5] MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX128T255OCTGBFIM : 1;       /**< \brief [6:6] MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX256T511OCTGBFIM : 1;       /**< \brief [7:7] MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX512T1023OCTGBFIM : 1;      /**< \brief [8:8] MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TX1024TMAXOCTGBFIM : 1;      /**< \brief [9:9] MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXUCGBFIM : 1;               /**< \brief [10:10] MMC Transmit Unicast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCGBFIM : 1;               /**< \brief [11:11] MMC Transmit Multicast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXBCGBFIM : 1;               /**< \brief [12:12] MMC Transmit Broadcast Good Bad Frame Counter Interrupt Mask (rw) */
    unsigned int TXUFLOWERFIM : 1;            /**< \brief [13:13] MMC Transmit Underflow Error Frame Counter Interrupt Mask (rw) */
    unsigned int TXSCOLGFIM : 1;              /**< \brief [14:14] MMC Transmit Single Collision Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXMCOLGFIM : 1;              /**< \brief [15:15] MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXDEFFIM : 1;                /**< \brief [16:16] MMC Transmit Deferred Frame Counter Interrupt Mask (rw) */
    unsigned int TXLATCOLFIM : 1;             /**< \brief [17:17] MMC Transmit Late Collision Frame Counter Interrupt Mask (rw) */
    unsigned int TXEXCOLFIM : 1;              /**< \brief [18:18] MMC Transmit Excessive Collision Frame Counter Interrupt Mask (rw) */
    unsigned int TXCARERFIM : 1;              /**< \brief [19:19] MMC Transmit Carrier Error Frame Counter Interrupt Mask (rw) */
    unsigned int TXGOCTIM : 1;                /**< \brief [20:20] MMC Transmit Good Octet Counter Interrupt Mask (rw) */
    unsigned int TXGFRMIM : 1;                /**< \brief [21:21] MMC Transmit Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXEXDEFFIM : 1;              /**< \brief [22:22] MMC Transmit Excessive Deferral Frame Counter Interrupt Mask (rw) */
    unsigned int TXPAUSFIM : 1;               /**< \brief [23:23] MMC Transmit Pause Frame Counter Interrupt Mask (rw) */
    unsigned int TXVLANGFIM : 1;              /**< \brief [24:24] MMC Transmit VLAN Good Frame Counter Interrupt Mask (rw) */
    unsigned int TXOSIZEGFIM : 1;             /**< \brief [25:25] MMC Transmit Oversize Good Frame Counter Interrupt Mask (rw) */
    unsigned int reserved_26 : 6;             /**< \brief \internal Reserved */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits;

