Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 6 - Operation Mode Register */
typedef struct _Ifx_ETH_OPERATION_MODE_Bits
{
    unsigned int reserved_0 : 1;              /**< \brief \internal Reserved */
    unsigned int SR : 1;                      /**< \brief [1:1] Start or Stop Receive (rw) */
    unsigned int OSF : 1;                     /**< \brief [2:2] Operate on Second Frame (rw) */
    unsigned int RTC : 2;                     /**< \brief [4:3] Receive Threshold Control (rw) */
    unsigned int reserved_5 : 1;              /**< \brief \internal Reserved */
    unsigned int FUF : 1;                     /**< \brief [6:6] Forward Undersized Good Frames (rw) */
    unsigned int FEF : 1;                     /**< \brief [7:7] Forward Error Frames (rw) */
    unsigned int EFC : 1;                     /**< \brief [8:8] Enable HW Flow Control (rw) */
    unsigned int RFA : 2;                     /**< \brief [10:9] Threshold for Activating Flow Control (in half-duplex and full-duplex) (rw) */
    unsigned int RFD : 2;                     /**< \brief [12:11] Threshold for Deactivating Flow Control (in half-duplex and full-duplex) (rw) */
    unsigned int ST : 1;                      /**< \brief [13:13] Start or Stop Transmission Command (rw) */
    unsigned int TTC : 3;                     /**< \brief [16:14] Transmit Threshold Control (rw) */
    unsigned int reserved_17 : 3;             /**< \brief \internal Reserved */
    unsigned int FTF : 1;                     /**< \brief [20:20] Flush Transmit FIFO (rw) */
    unsigned int TSF : 1;                     /**< \brief [21:21] Transmit Store and Forward (rw) */
    unsigned int RFD_2 : 1;                   /**< \brief [22:22] MSB of Threshold for Deactivating Flow Control (r) */
    unsigned int RFA_2 : 1;                   /**< \brief [23:23] MSB of Threshold for Activating Flow Control (r) */
    unsigned int DFF : 1;                     /**< \brief [24:24] Disable Flushing of Received Frames (rw) */
    unsigned int RSF : 1;                     /**< \brief [25:25] Receive Store and Forward (rw) */
    unsigned int DT : 1;                      /**< \brief [26:26] Disable Dropping of TCP/IP Checksum Error Frames (rw) */
    unsigned int reserved_27 : 5;             /**< \brief \internal Reserved */
} Ifx_ETH_OPERATION_MODE_Bits;

/** \brief  Register 11 - PMT Control and Status Register */
typedef struct _Ifx_ETH_PMT_CONTROL_STATUS_Bits
{
    unsigned int PWRDWN : 1;                  /**< \brief [0:0] Power Down (rw) */
    unsigned int MGKPKTEN : 1;                /**< \brief [1:1] Magic Packet Enable (rw) */
    unsigned int RWKPKTEN : 1;                /**< \brief [2:2] Wake-Up Frame Enable (rw) */
    unsigned int reserved_3 : 2;              /**< \brief \internal Reserved */
    unsigned int MGKPRCVD : 1;                /**< \brief [5:5] Magic Packet Received (r) */
    unsigned int RWKPRCVD : 1;                /**< \brief [6:6] Wake-Up Frame Received (r) */
    unsigned int reserved_7 : 2;              /**< \brief \internal Reserved */
    unsigned int GLBLUCAST : 1;               /**< \brief [9:9] Global Unicast (rw) */
    unsigned int reserved_10 : 21;            /**< \brief \internal Reserved */
    unsigned int RWKFILTRST : 1;              /**< \brief [31:31] Wake-Up Frame Filter Register Pointer Reset (rw) */
} Ifx_ETH_PMT_CONTROL_STATUS_Bits;

/** \brief  Register 459 - PPS Control Register */
typedef struct _Ifx_ETH_PPS_CONTROL_Bits
{
    unsigned int PPSCTRL_PPSCMD : 4;          /**< \brief [3:0] PPSCTRL0 or PPSCMD0 (rw) */
    unsigned int PPSEN0 : 1;                  /**< \brief [4:4] Flexible PPS Output Mode Enable (r) */
    unsigned int TRGTMODSEL0 : 2;             /**< \brief [6:5] Target Time Register Mode for PPS0 Output (r) */
    unsigned int reserved_7 : 1;              /**< \brief \internal Reserved */
    unsigned int PPSCMD1 : 3;                 /**< \brief [10:8] Flexible PPS1 Output Control (r) */
    unsigned int reserved_11 : 2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL1 : 2;             /**< \brief [14:13] Target Time Register Mode for PPS1 Output (r) */
    unsigned int reserved_15 : 1;             /**< \brief \internal Reserved */
    unsigned int PPSCMD2 : 3;                 /**< \brief [18:16] Flexible PPS2 Output Control (r) */
    unsigned int reserved_19 : 2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL2 : 2;             /**< \brief [22:21] Target Time Register Mode for PPS2 Output (r) */
    unsigned int reserved_23 : 1;             /**< \brief \internal Reserved */
    unsigned int PPSCMD3 : 3;                 /**< \brief [26:24] Flexible PPS3 Output Control (r) */
    unsigned int reserved_27 : 2;             /**< \brief \internal Reserved */
    unsigned int TRGTMODSEL3 : 2;             /**< \brief [30:29] Target Time Register Mode for PPS3 Output (r) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_ETH_PPS_CONTROL_Bits;

/** \brief  Register 3 - Receive Descriptor List Address Register */
typedef struct _Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int RDESLA : 30;                 /**< \brief [31:2] Start of Receive List (rw) */
} Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits;

/** \brief  Register 9 - Receive Interrupt Watchdog Timer Register */
typedef struct _Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits
{
    unsigned int RIWT : 8;                    /**< \brief [7:0] RI Watchdog Timer Count (rw) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits;

/** \brief  Register 2 - Receive Poll Demand Register */
typedef struct _Ifx_ETH_RECEIVE_POLL_DEMAND_Bits
{
    unsigned int RPD : 32;                    /**< \brief [31:0] Receive Poll Demand (rw) */
} Ifx_ETH_RECEIVE_POLL_DEMAND_Bits;

/** \brief  Register 10 - Remote Wake-Up Frame Filter Register */
typedef struct _Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits
{
    unsigned int WKUPFRMFTR : 32;             /**< \brief [31:0] WKUPFRMFTR (rw) */
} Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits;

