Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 112 - Receive Frame Count for Good and Bad 1,024 to Maxsize
 * Bytes Frames */
typedef struct _Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX1024_MAXOCTGB : 32;        /**< \brief [31:0] RX1024_MAXOCTGB (r) */
} Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 109 - Receive Frame Count for Good and Bad 128 to 255 Bytes
 * Frames */
typedef struct _Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX128_255OCTGB : 32;         /**< \brief [31:0] RX128_255OCTGB (r) */
} Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 110 - Receive Frame Count for Good and Bad 256 to 511 Bytes
 * Frames */
typedef struct _Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX256_511OCTGB : 32;         /**< \brief [31:0] RX256_511OCTGB (r) */
} Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 111 - Receive Frame Count for Good and Bad 512 to 1,023
 * Bytes Frames */
typedef struct _Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX512_1023OCTGB : 32;        /**< \brief [31:0] RX512_1023OCTGB (r) */
} Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 107 - Receive Frame Count for Good and Bad 64 Byte Frames */
typedef struct _Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX64OCTGB : 32;              /**< \brief [31:0] RX64OCTGB (r) */
} Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 108 - Receive Frame Count for Good and Bad 65 to 127 Bytes
 * Frames */
typedef struct _Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int RX65_127OCTGB : 32;          /**< \brief [31:0] RX65_127OCTGB (r) */
} Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 102 - Receive Frame Count for Alignment Error Frames */
typedef struct _Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits
{
    unsigned int RXALGNERR : 32;              /**< \brief [31:0] RXALGNERR (r) */
} Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES_Bits;

/** \brief  Register 99 - Receive Frame Count for Good Broadcast Frames */
typedef struct _Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits
{
    unsigned int RXBCASTG : 32;               /**< \brief [31:0] RXBCASTG (r) */
} Ifx_ETH_RX_BROADCAST_FRAMES_GOOD_Bits;

/** \brief  Register 121 - Receive Frame Count for Good Control Frames Frames */
typedef struct _Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits
{
    unsigned int RXCTRLG : 32;                /**< \brief [31:0] RXCTRLG (r) */
} Ifx_ETH_RX_CONTROL_FRAMES_GOOD_Bits;

/** \brief  Register 101 - Receive Frame Count for CRC Error Frames */
typedef struct _Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits
{
    unsigned int RXCRCERR : 32;               /**< \brief [31:0] RXCRCERR (r) */
} Ifx_ETH_RX_CRC_ERROR_FRAMES_Bits;

/** \brief  Register 117 - Receive Frame Count for FIFO Overflow Frames */
typedef struct _Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits
{
    unsigned int RXFIFOOVFL : 32;             /**< \brief [31:0] RXFIFOOVFL (r) */
} Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES_Bits;

/** \brief  Register 96 - Receive Frame Count for Good and Bad Frames */
typedef struct _Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits
{
    unsigned int RXFRMGB : 32;                /**< \brief [31:0] RXFRMGB (r) */
} Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD_Bits;

/** \brief  Register 104 - Receive Frame Count for Jabber Error Frames */
typedef struct _Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits
{
    unsigned int RXJABERR : 32;               /**< \brief [31:0] RXJABERR (r) */
} Ifx_ETH_RX_JABBER_ERROR_FRAMES_Bits;

/** \brief  Register 114 - Receive Frame Count for Length Error Frames */
typedef struct _Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits
{
    unsigned int RXLENERR : 32;               /**< \brief [31:0] RXLENERR (r) */
} Ifx_ETH_RX_LENGTH_ERROR_FRAMES_Bits;

/** \brief  Register 100 - Receive Frame Count for Good Multicast Frames */
typedef struct _Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits
{
    unsigned int RXMCASTG : 32;               /**< \brief [31:0] RXMCASTG (r) */
} Ifx_ETH_RX_MULTICAST_FRAMES_GOOD_Bits;

/** \brief  Register 97 - Receive Octet Count for Good and Bad Frames */
typedef struct _Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits
{
    unsigned int RXOCTGB : 32;                /**< \brief [31:0] RXOCTGB (r) */
} Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD_Bits;

/** \brief  Register 98 - Receive Octet Count for Good Frames */
typedef struct _Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits
{
    unsigned int RXOCTG : 32;                 /**< \brief [31:0] RXOCTG (r) */
} Ifx_ETH_RX_OCTET_COUNT_GOOD_Bits;

/** \brief  Register 115 - Receive Frame Count for Out of Range Frames */
typedef struct _Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits
{
    unsigned int RXOUTOFRNG : 32;             /**< \brief [31:0] RXOUTOFRNG (r) */
} Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES_Bits;

/** \brief  Register 106 - Receive Frame Count for Oversize Frames */
typedef struct _Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits
{
    unsigned int RXOVERSZG : 32;              /**< \brief [31:0] RXOVERSZG (r) */
} Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD_Bits;

/** \brief  Register 116 - Receive Frame Count for PAUSE Frames */
typedef struct _Ifx_ETH_RX_PAUSE_FRAMES_Bits
{
    unsigned int RXPAUSEFRM : 32;             /**< \brief [31:0] RXPAUSEFRM (r) */
} Ifx_ETH_RX_PAUSE_FRAMES_Bits;

/** \brief  Register 120 - Receive Frame Count for Receive Error Frames */
typedef struct _Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits
{
    unsigned int RXRCVERR : 32;               /**< \brief [31:0] RXRCVERR (r) */
} Ifx_ETH_RX_RECEIVE_ERROR_FRAMES_Bits;

/** \brief  Register 103 - Receive Frame Count for Runt Error Frames */
typedef struct _Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits
{
    unsigned int RXRUNTERR : 32;              /**< \brief [31:0] RXRUNTERR (r) */
} Ifx_ETH_RX_RUNT_ERROR_FRAMES_Bits;

/** \brief  Register 105 - Receive Frame Count for Undersize Frames */
typedef struct _Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits
{
    unsigned int RXUNDERSZG : 32;             /**< \brief [31:0] RXUNDERSZG (r) */
} Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD_Bits;

/** \brief  Register 113 - Receive Frame Count for Good Unicast Frames */
typedef struct _Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits
{
    unsigned int RXUCASTG : 32;               /**< \brief [31:0] RXUCASTG (r) */
} Ifx_ETH_RX_UNICAST_FRAMES_GOOD_Bits;

/** \brief  Register 118 - Receive Frame Count for Good and Bad VLAN Frames */
typedef struct _Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits
{
    unsigned int RXVLANFRGB : 32;             /**< \brief [31:0] RXVLANFRGB (r) */
} Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 119 - Receive Frame Count for Watchdog Error Frames */
typedef struct _Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits
{
    unsigned int RXWDGERR : 32;               /**< \brief [31:0] RXWDGERR (r) */
} Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES_Bits;

/** \brief  Register 145 - Receive ICMP Error Frame Counter Register */
typedef struct _Ifx_ETH_RXICMP_ERROR_FRAMES_Bits
{
    unsigned int RXICMPERRFRM : 32;           /**< \brief [31:0] RXICMPERRFRM (r) */
} Ifx_ETH_RXICMP_ERROR_FRAMES_Bits;

