Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 157 - Receive UDP Error Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_ERROR_OCTETS_Bits
{
    unsigned int RXUDPERROCT : 32;            /**< \brief [31:0] RXUDPERROCT (r) */
} Ifx_ETH_RXUDP_ERROR_OCTETS_Bits;

/** \brief  Register 140 - Receive UDP Good Frame Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_FRAMES_Bits
{
    unsigned int RXUDPGDFRM : 32;             /**< \brief [31:0] RXUDPGDFRM (r) */
} Ifx_ETH_RXUDP_GOOD_FRAMES_Bits;

/** \brief  Register 156 - Receive UDP Good Octet Counter Register */
typedef struct _Ifx_ETH_RXUDP_GOOD_OCTETS_Bits
{
    unsigned int RXUDPGDOCT : 32;             /**< \brief [31:0] RXUDPGDOCT (r) */
} Ifx_ETH_RXUDP_GOOD_OCTETS_Bits;

/** \brief  Register 5 - Status Register */
typedef struct _Ifx_ETH_STATUS_Bits
{
    unsigned int TI : 1;                      /**< \brief [0:0] Transmit Interrupt (rw) */
    unsigned int TPS : 1;                     /**< \brief [1:1] Transmit Process Stopped (rw) */
    unsigned int TU : 1;                      /**< \brief [2:2] Transmit Buffer Unavailable (rw) */
    unsigned int TJT : 1;                     /**< \brief [3:3] Transmit Jabber Timeout (rw) */
    unsigned int OVF : 1;                     /**< \brief [4:4] Receive Overflow (rw) */
    unsigned int UNF : 1;                     /**< \brief [5:5] Transmit Underflow (rw) */
    unsigned int RI : 1;                      /**< \brief [6:6] Receive Interrupt (rw) */
    unsigned int RU : 1;                      /**< \brief [7:7] Receive Buffer Unavailable (rw) */
    unsigned int RPS : 1;                     /**< \brief [8:8] Receive Process Stopped (rw) */
    unsigned int RWT : 1;                     /**< \brief [9:9] Receive Watchdog Timeout (rw) */
    unsigned int ETI : 1;                     /**< \brief [10:10] Early Transmit Interrupt (rw) */
    unsigned int reserved_11 : 2;             /**< \brief \internal Reserved */
    unsigned int FBI : 1;                     /**< \brief [13:13] Fatal Bus Error Interrupt (rw) */
    unsigned int ERI : 1;                     /**< \brief [14:14] Early Receive Interrupt (rw) */
    unsigned int AIS : 1;                     /**< \brief [15:15] Abnormal Interrupt Summary (rw) */
    unsigned int NIS : 1;                     /**< \brief [16:16] Normal Interrupt Summary (rw) */
    unsigned int RS : 3;                      /**< \brief [19:17] Received Process State (r) */
    unsigned int TS : 3;                      /**< \brief [22:20] Transmit Process State (r) */
    unsigned int EB : 3;                      /**< \brief [25:23] Error Bits (r) */
    unsigned int GLI : 1;                     /**< \brief [26:26] GMAC Line interface Interrupt (r) */
    unsigned int GMI : 1;                     /**< \brief [27:27] GMAC MMC Interrupt (r) */
    unsigned int GPI : 1;                     /**< \brief [28:28] GMAC PMT Interrupt (r) */
    unsigned int TTI : 1;                     /**< \brief [29:29] Timestamp Trigger Interrupt (r) */
    unsigned int GLPII : 1;                   /**< \brief [30:30] GMAC LPI Interrupt (for Channel 0) (r) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_ETH_STATUS_Bits;

/** \brief  Register 449 - Sub-Second Increment Register */
typedef struct _Ifx_ETH_SUB_SECOND_INCREMENT_Bits
{
    unsigned int SSINC : 8;                   /**< \brief [7:0] Sub-second Increment Value (rw) */
    unsigned int reserved_8 : 24;             /**< \brief \internal Reserved */
} Ifx_ETH_SUB_SECOND_INCREMENT_Bits;

/** \brief  Register 457 - System Time - Higher Word Seconds Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits
{
    unsigned int TSHWR : 16;                  /**< \brief [15:0] Timestamp Higher Word Register (rw) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS_Bits;

/** \brief  Register 451 - System Time - Nanoseconds Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits
{
    unsigned int TSSS : 31;                   /**< \brief [30:0] Timestamp Sub Seconds (r) */
    unsigned int reserved_31 : 1;             /**< \brief \internal Reserved */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS_Bits;

/** \brief  Register 453 - System Time - Nanoseconds Update Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits
{
    unsigned int TSSS : 31;                   /**< \brief [30:0] Timestamp Sub Second (rw) */
    unsigned int ADDSUB : 1;                  /**< \brief [31:31] Add or subtract time (rw) */
} Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE_Bits;

/** \brief  Register 450 - System Time - Seconds Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_SECONDS_Bits
{
    unsigned int TSS : 32;                    /**< \brief [31:0] Timestamp Second (r) */
} Ifx_ETH_SYSTEM_TIME_SECONDS_Bits;

/** \brief  Register 452 - System Time - Seconds Update Register */
typedef struct _Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits
{
    unsigned int TSS : 32;                    /**< \brief [31:0] Timestamp Second (rw) */
} Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE_Bits;

/** \brief  Register 456 - Target Time Nanoseconds Register */
typedef struct _Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits
{
    unsigned int TTSLO : 31;                  /**< \brief [30:0] Target Timestamp Low Register (rw) */
    unsigned int TRGTBUSY : 1;                /**< \brief [31:31] Target Time Register Busy (r) */
} Ifx_ETH_TARGET_TIME_NANOSECONDS_Bits;

/** \brief  Register 455 - Target Time Seconds Register */
typedef struct _Ifx_ETH_TARGET_TIME_SECONDS_Bits
{
    unsigned int TSTR : 32;                   /**< \brief [31:0] Target Time Seconds Register (rw) */
} Ifx_ETH_TARGET_TIME_SECONDS_Bits;

/** \brief  Register 454 - Timestamp Addend Register */
typedef struct _Ifx_ETH_TIMESTAMP_ADDEND_Bits
{
    unsigned int TSAR : 32;                   /**< \brief [31:0] Timestamp Addend Register (rw) */
} Ifx_ETH_TIMESTAMP_ADDEND_Bits;

/** \brief  Register 448 - Timestamp Control Register */
typedef struct _Ifx_ETH_TIMESTAMP_CONTROL_Bits
{
    unsigned int TSENA : 1;                   /**< \brief [0:0] Timestamp Enable (rw) */
    unsigned int TSCFUPDT : 1;                /**< \brief [1:1] Timestamp Fine or Coarse Update (rw) */
    unsigned int TSINIT : 1;                  /**< \brief [2:2] Timestamp Initialize (rw) */
    unsigned int TSUPDT : 1;                  /**< \brief [3:3] Timestamp Update (rw) */
    unsigned int TSTRIG : 1;                  /**< \brief [4:4] Timestamp Interrupt Trigger Enable (rw) */
    unsigned int TSADDREG : 1;                /**< \brief [5:5] Addend Reg Update (rw) */
    unsigned int reserved_6 : 2;              /**< \brief \internal Reserved */
    unsigned int TSENALL : 1;                 /**< \brief [8:8] Enable Timestamp for All Frames (rw) */
    unsigned int TSCTRLSSR : 1;               /**< \brief [9:9] Timestamp Digital or Binary Rollover Control (rw) */
    unsigned int TSVER2ENA : 1;               /**< \brief [10:10] Enable PTP packet Processing for Version 2 Format (rw) */
    unsigned int TSIPENA : 1;                 /**< \brief [11:11] Enable Processing of PTP over Ethernet Frames (rw) */
    unsigned int TSIPV6ENA : 1;               /**< \brief [12:12] Enable Processing of PTP Frames Sent Over IPv6-UDP (rw) */
    unsigned int TSIPV4ENA : 1;               /**< \brief [13:13] Enable Processing of PTP Frames Sent over IPv4-UDP (rw) */
    unsigned int TSEVNTENA : 1;               /**< \brief [14:14] Enable Timestamp Snapshot for Event Messages (rw) */
    unsigned int TSMSTRENA : 1;               /**< \brief [15:15] Enable Snapshot for Messages Relevant to Master (rw) */
    unsigned int SNAPTYPSEL : 2;              /**< \brief [17:16] Select PTP packets for Taking Snapshots (rw) */
    unsigned int TSENMACADDR : 1;             /**< \brief [18:18] Enable MAC address for PTP Frame Filtering (rw) */
    unsigned int reserved_19 : 5;             /**< \brief \internal Reserved */
    unsigned int ATSFC : 1;                   /**< \brief [24:24] Auxiliary Snapshot FIFO Clear (r) */
    unsigned int ATSEN0 : 1;                  /**< \brief [25:25] Auxiliary Snapshot 0 Enable (r) */
    unsigned int ATSEN1 : 1;                  /**< \brief [26:26] Auxiliary Snapshot 1 Enable (r) */
    unsigned int ATSEN2 : 1;                  /**< \brief [27:27] Auxiliary Snapshot 2 Enable (r) */
    unsigned int ATSEN3 : 1;                  /**< \brief [28:28] Auxiliary Snapshot 3 Enable (r) */
    unsigned int reserved_29 : 3;             /**< \brief \internal Reserved */
} Ifx_ETH_TIMESTAMP_CONTROL_Bits;

/** \brief  Register 458 - Timestamp Status Register */
typedef struct _Ifx_ETH_TIMESTAMP_STATUS_Bits
{
    unsigned int TSSOVF : 1;                  /**< \brief [0:0] Timestamp Seconds Overflow (r) */
    unsigned int TSTARGT : 1;                 /**< \brief [1:1] Timestamp Target Time Reached (r) */
    unsigned int AUXTSTRIG : 1;               /**< \brief [2:2] Auxiliary Timestamp Trigger Snapshot (r) */
    unsigned int TSTRGTERR : 1;               /**< \brief [3:3] Timestamp Target Time Error (r) */
    unsigned int TSTARGT1 : 1;                /**< \brief [4:4] Timestamp Target Time Reached for Target Time PPS1 (r) */
    unsigned int TSTRGTERR1 : 1;              /**< \brief [5:5] Timestamp Target Time Error (r) */
    unsigned int TSTARGT2 : 1;                /**< \brief [6:6] Timestamp Target Time Reached for Target Time PPS2 (r) */
    unsigned int TSTRGTERR2 : 1;              /**< \brief [7:7] Timestamp Target Time Error (r) */
    unsigned int TSTARGT3 : 1;                /**< \brief [8:8] Timestamp Target Time Reached for Target Time PPS3 (r) */
    unsigned int TSTRGTERR3 : 1;              /**< \brief [9:9] Timestamp Target Time Error (r) */
    unsigned int reserved_10 : 6;             /**< \brief \internal Reserved */
    unsigned int ATSSTN : 4;                  /**< \brief [19:16] Auxiliary Timestamp Snapshot Trigger Identifier (r) */
    unsigned int reserved_20 : 4;             /**< \brief \internal Reserved */
    unsigned int ATSSTM : 1;                  /**< \brief [24:24] Auxiliary Timestamp Snapshot Trigger Missed (r) */
    unsigned int ATSNS : 5;                   /**< \brief [29:25] Number of Auxiliary Timestamp Snapshots (r) */
    unsigned int reserved_30 : 2;             /**< \brief \internal Reserved */
} Ifx_ETH_TIMESTAMP_STATUS_Bits;

