Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 4 - Transmit Descriptor List Address Register */
typedef struct _Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits
{
    unsigned int reserved_0 : 2;              /**< \brief \internal Reserved */
    unsigned int TDESLA : 30;                 /**< \brief [31:2] Start of Transmit List (rw) */
} Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS_Bits;

/** \brief  Register 1 - Transmit Poll Demand Register */
typedef struct _Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits
{
    unsigned int TPD : 32;                    /**< \brief [31:0] Transmit Poll Demand (rw) */
} Ifx_ETH_TRANSMIT_POLL_DEMAND_Bits;

/** \brief  Register 78 - Transmit Octet Count for Good and Bad 1024 to Maxsize
 * Bytes Frames */
typedef struct _Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX1024_MAXOCTGB : 32;        /**< \brief [31:0] TX1024_MAXOCTGB (r) */
} Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 75 - Transmit Octet Count for Good and Bad 128 to 255 Bytes
 * Frames */
typedef struct _Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX128_255OCTGB : 32;         /**< \brief [31:0] TX128_255OCTGB (r) */
} Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 76 - Transmit Octet Count for Good and Bad 256 to 511 Bytes
 * Frames */
typedef struct _Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX256_511OCTGB : 32;         /**< \brief [31:0] TX256_511OCTGB (r) */
} Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 77 - Transmit Octet Count for Good and Bad 512 to 1023
 * Bytes Frames */
typedef struct _Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX512_1023OCTGB : 32;        /**< \brief [31:0] TX512_1023OCTGB (r) */
} Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 73 - Transmit Octet Count for Good and Bad 64 Byte Frames */
typedef struct _Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX64OCTGB : 32;              /**< \brief [31:0] TX64OCTGB (r) */
} Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 74 - Transmit Octet Count for Good and Bad 65 to 127 Bytes
 * Frames */
typedef struct _Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits
{
    unsigned int TX65_127OCTGB : 32;          /**< \brief [31:0] TX65_127OCTGB (r) */
} Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 81 - Transmit Frame Count for Good and Bad Broadcast Frames */
typedef struct _Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits
{
    unsigned int TXBCASTGB : 32;              /**< \brief [31:0] TXBCASTGB (r) */
} Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 71 - Transmit Frame Count for Good Broadcast Frames */
typedef struct _Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits
{
    unsigned int TXBCASTG : 32;               /**< \brief [31:0] TXBCASTG (r) */
} Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_Bits;

/** \brief  Register 88 - Transmit Frame Count for Carrier Sense Error Frames */
typedef struct _Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits
{
    unsigned int TXCARR : 32;                 /**< \brief [31:0] TXCARR (r) */
} Ifx_ETH_TX_CARRIER_ERROR_FRAMES_Bits;

/** \brief  Register 85 - Transmit Frame Count for Deferred Frames */
typedef struct _Ifx_ETH_TX_DEFERRED_FRAMES_Bits
{
    unsigned int TXDEFRD : 32;                /**< \brief [31:0] TXDEFRD (r) */
} Ifx_ETH_TX_DEFERRED_FRAMES_Bits;

/** \brief  Register 87 - Transmit Frame Count for Excessive Collision Error
 * Frames */
typedef struct _Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits
{
    unsigned int TXEXSCOL : 32;               /**< \brief [31:0] TXEXSCOL (r) */
} Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits;

/** \brief  Register 91 - Transmit Frame Count for Excessive Deferral Error
 * Frames */
typedef struct _Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits
{
    unsigned int TXEXSDEF : 32;               /**< \brief [31:0] TXEXSDEF (r) */
} Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits;

/** \brief  Register 70 - Transmit Frame Count for Good and Bad Frames */
typedef struct _Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits
{
    unsigned int TXFRMGB : 32;                /**< \brief [31:0] TXFRMGB (r) */
} Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits;

/** \brief  Register 90 - Transmit Frame Count for Good Frames */
typedef struct _Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits
{
    unsigned int TXFRMG : 32;                 /**< \brief [31:0] TXFRMG (r) */
} Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits;

/** \brief  Register 86 - Transmit Frame Count for Late Collision Error Frames */
typedef struct _Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits
{
    unsigned int TXLATECOL : 32;              /**< \brief [31:0] TXLATECOL (r) */
} Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits;

/** \brief  Register 80 - Transmit Frame Count for Good and Bad Multicast Frames */
typedef struct _Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits
{
    unsigned int TXMCASTGB : 32;              /**< \brief [31:0] TXMCASTGB (r) */
} Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 72 - Transmit Frame Count for Good Multicast Frames */
typedef struct _Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits
{
    unsigned int TXMCASTG : 32;               /**< \brief [31:0] TXMCASTG (r) */
} Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits;

/** \brief  Register 84 - Transmit Frame Count for Frames Transmitted after
 * Multiple Collision */
typedef struct _Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits
{
    unsigned int TXMULTCOLG : 32;             /**< \brief [31:0] TXMULTCOLG (r) */
} Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits;

/** \brief  Register 69 - Transmit Octet Count for Good and Bad Frames */
typedef struct _Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits
{
    unsigned int TXOCTGB : 32;                /**< \brief [31:0] TXOCTGB (r) */
} Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits;

/** \brief  Register 89 - Transmit Octet Count for Good Frames */
typedef struct _Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits
{
    unsigned int TXOCTG : 32;                 /**< \brief [31:0] TXOCTG (r) */
} Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits;

/** \brief  Register 94 - Transmit Frame Count for Good Oversize Frames */
typedef struct _Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits
{
    unsigned int TXOSIZG : 32;                /**< \brief [31:0] TXOSIZG (r) */
} Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits;

/** \brief  Register 92 - Transmit Frame Count for Good PAUSE Frames */
typedef struct _Ifx_ETH_TX_PAUSE_FRAMES_Bits
{
    unsigned int TXPAUSE : 32;                /**< \brief [31:0] TXPAUSE (r) */
} Ifx_ETH_TX_PAUSE_FRAMES_Bits;

/** \brief  Register 83 - Transmit Frame Count for Frames Transmitted after
 * Single Collision */
typedef struct _Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits
{
    unsigned int TXSNGLCOLG : 32;             /**< \brief [31:0] TXSNGLCOLG (r) */
} Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits;

/** \brief  Register 82 - Transmit Frame Count for Underflow Error Frames */
typedef struct _Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits
{
    unsigned int TXUNDRFLW : 32;              /**< \brief [31:0] TXUNDRFLW (r) */
} Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits;

/** \brief  Register 79 - Transmit Frame Count for Good and Bad Unicast Frames */
typedef struct _Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits
{
    unsigned int TXUCASTGB : 32;              /**< \brief [31:0] TXUCASTGB (r) */
} Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits;

/** \brief  Register 93 - Transmit Frame Count for Good VLAN Frames */
typedef struct _Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits
{
    unsigned int TXVLANG : 32;                /**< \brief [31:0] TXVLANG (r) */
} Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits;

/** \brief  Register 8 - Version Register */
typedef struct _Ifx_ETH_VERSION_Bits
{
    unsigned int SNPSVER : 8;                 /**< \brief [7:0] SNPSVER (r) */
    unsigned int USERVER : 8;                 /**< \brief [15:8] USERVER (r) */
    unsigned int reserved_16 : 16;            /**< \brief \internal Reserved */
} Ifx_ETH_VERSION_Bits;

/** \brief  Register 7 - VLAN Tag Register */
typedef struct _Ifx_ETH_VLAN_TAG_Bits
{
    unsigned int VL : 16;                     /**< \brief [15:0] VLAN Tag Identifier for Receive Frames (rw) */
    unsigned int ETV : 1;                     /**< \brief [16:16] Enable 12-Bit VLAN Tag Comparison (rw) */
    unsigned int VTIM : 1;                    /**< \brief [17:17] VLAN Tag Inverse Match Enable (rw) */
    unsigned int ESVL : 1;                    /**< \brief [18:18] Enable S-VLAN (rw) */
    unsigned int VTHM : 1;                    /**< \brief [19:19] VLAN Tag Hash Table Match Enable (r) */
    unsigned int reserved_20 : 12;            /**< \brief \internal Reserved */
} Ifx_ETH_VLAN_TAG_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eth_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int        U;                  /**< \brief Unsigned access */
    signed int          I;                  /**< \brief Signed access */
    Ifx_ETH_ACCEN0_Bits B;                  /**< \brief Bitfield access */
} Ifx_ETH_ACCEN0;

