Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int         U;                 /**< \brief Unsigned access */
    signed int           I;                 /**< \brief Signed access */
    Ifx_ETH_KRSTCLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_ETH_KRSTCLR;

/** \brief  MAC Address High Register */
typedef union
{
    unsigned int                  U;        /**< \brief Unsigned access */
    signed int                    I;        /**< \brief Signed access */
    Ifx_ETH_MAC_ADDRESS_HIGH_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_MAC_ADDRESS_HIGH;

/** \brief  MAC Address Low Register */
typedef union
{
    unsigned int                 U;         /**< \brief Unsigned access */
    signed int                   I;         /**< \brief Signed access */
    Ifx_ETH_MAC_ADDRESS_LOW_Bits B;         /**< \brief Bitfield access */
} Ifx_ETH_MAC_ADDRESS_LOW;

/** \brief  Register 0 - MAC Configuration Register */
typedef union
{
    unsigned int                   U;       /**< \brief Unsigned access */
    signed int                     I;       /**< \brief Signed access */
    Ifx_ETH_MAC_CONFIGURATION_Bits B;       /**< \brief Bitfield access */
} Ifx_ETH_MAC_CONFIGURATION;

/** \brief  Register 1 - MAC Frame Filter */
typedef union
{
    unsigned int                  U;        /**< \brief Unsigned access */
    signed int                    I;        /**< \brief Signed access */
    Ifx_ETH_MAC_FRAME_FILTER_Bits B;        /**< \brief Bitfield access */
} Ifx_ETH_MAC_FRAME_FILTER;

/** \brief  Register 8 - Missed Frame and Buffer Overflow Counter Register */
typedef union
{
    unsigned int                                          U; /**< \brief Unsigned access */
    signed int                                            I; /**< \brief Signed access */
    Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER;

/** \brief  Register 64 - MMC Control Register */
typedef union
{
    unsigned int             U;             /**< \brief Unsigned access */
    signed int               I;             /**< \brief Signed access */
    Ifx_ETH_MMC_CONTROL_Bits B;             /**< \brief Bitfield access */
} Ifx_ETH_MMC_CONTROL;

/** \brief  Register 130 - MMC Receive Checksum Offload Interrupt Register */
typedef union
{
    unsigned int                           U; /**< \brief Unsigned access */
    signed int                             I; /**< \brief Signed access */
    Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT;

/** \brief  Register 128 - MMC Receive Checksum Offload Interrupt Mask Register */
typedef union
{
    unsigned int                                U; /**< \brief Unsigned access */
    signed int                                  I; /**< \brief Signed access */
    Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK;

/** \brief  Register 65 - MMC Receive Interrupt Register */
typedef union
{
    unsigned int                       U;   /**< \brief Unsigned access */
    signed int                         I;   /**< \brief Signed access */
    Ifx_ETH_MMC_RECEIVE_INTERRUPT_Bits B;   /**< \brief Bitfield access */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT;

/** \brief  - */
typedef union
{
    unsigned int                            U; /**< \brief Unsigned access */
    signed int                              I; /**< \brief Signed access */
    Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK;

/** \brief  Register 66 - MMC Transmit Interrupt Register */
typedef union
{
    unsigned int                        U;  /**< \brief Unsigned access */
    signed int                          I;  /**< \brief Signed access */
    Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits B;  /**< \brief Bitfield access */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT;

/** \brief  Register 68 - MMC Transmit Interrupt Mask Register */
typedef union
{
    unsigned int                             U; /**< \brief Unsigned access */
    signed int                               I; /**< \brief Signed access */
    Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK;

/** \brief  Register 6 - Operation Mode Register */
typedef union
{
    unsigned int                U;          /**< \brief Unsigned access */
    signed int                  I;          /**< \brief Signed access */
    Ifx_ETH_OPERATION_MODE_Bits B;          /**< \brief Bitfield access */
} Ifx_ETH_OPERATION_MODE;

/** \brief  Register 11 - PMT Control and Status Register */
typedef union
{
    unsigned int                    U;      /**< \brief Unsigned access */
    signed int                      I;      /**< \brief Signed access */
    Ifx_ETH_PMT_CONTROL_STATUS_Bits B;      /**< \brief Bitfield access */
} Ifx_ETH_PMT_CONTROL_STATUS;

/** \brief  Register 459 - PPS Control Register */
typedef union
{
    unsigned int             U;             /**< \brief Unsigned access */
    signed int               I;             /**< \brief Signed access */
    Ifx_ETH_PPS_CONTROL_Bits B;             /**< \brief Bitfield access */
} Ifx_ETH_PPS_CONTROL;

/** \brief  Register 3 - Receive Descriptor List Address Register */
typedef union
{
    unsigned int                                 U; /**< \brief Unsigned access */
    signed int                                   I; /**< \brief Signed access */
    Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS;

/** \brief  Register 9 - Receive Interrupt Watchdog Timer Register */
typedef union
{
    unsigned int                                  U; /**< \brief Unsigned access */
    signed int                                    I; /**< \brief Signed access */
    Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER;

/** \brief  Register 2 - Receive Poll Demand Register */
typedef union
{
    unsigned int                     U;     /**< \brief Unsigned access */
    signed int                       I;     /**< \brief Signed access */
    Ifx_ETH_RECEIVE_POLL_DEMAND_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_RECEIVE_POLL_DEMAND;

/** \brief  Register 10 - Remote Wake-Up Frame Filter Register */
typedef union
{
    unsigned int                             U; /**< \brief Unsigned access */
    signed int                               I; /**< \brief Signed access */
    Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER;

