Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
/** \brief  Register 80 - Transmit Frame Count for Good and Bad Multicast Frames */
typedef union
{
    unsigned int                              U; /**< \brief Unsigned access */
    signed int                                I; /**< \brief Signed access */
    Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD;

/** \brief  Register 84 - Transmit Frame Count for Frames Transmitted after
 * Multiple Collision */
typedef union
{
    unsigned int                                   U; /**< \brief Unsigned access */
    signed int                                     I; /**< \brief Signed access */
    Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES;

/** \brief  Register 89 - Transmit Octet Count for Good Frames */
typedef union
{
    unsigned int                     U;     /**< \brief Unsigned access */
    signed int                       I;     /**< \brief Signed access */
    Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_TX_OCTET_COUNT_GOOD;

/** \brief  Register 69 - Transmit Octet Count for Good and Bad Frames */
typedef union
{
    unsigned int                         U; /**< \brief Unsigned access */
    signed int                           I; /**< \brief Signed access */
    Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD;

/** \brief  Register 94 - Transmit Frame Count for Good Oversize Frames */
typedef union
{
    unsigned int                      U;    /**< \brief Unsigned access */
    signed int                        I;    /**< \brief Signed access */
    Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits B;    /**< \brief Bitfield access */
} Ifx_ETH_TX_OSIZE_FRAMES_GOOD;

/** \brief  Register 92 - Transmit Frame Count for Good PAUSE Frames */
typedef union
{
    unsigned int                 U;         /**< \brief Unsigned access */
    signed int                   I;         /**< \brief Signed access */
    Ifx_ETH_TX_PAUSE_FRAMES_Bits B;         /**< \brief Bitfield access */
} Ifx_ETH_TX_PAUSE_FRAMES;

/** \brief  Register 83 - Transmit Frame Count for Frames Transmitted after
 * Single Collision */
typedef union
{
    unsigned int                                 U; /**< \brief Unsigned access */
    signed int                                   I; /**< \brief Signed access */
    Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES;

/** \brief  Register 82 - Transmit Frame Count for Underflow Error Frames */
typedef union
{
    unsigned int                           U; /**< \brief Unsigned access */
    signed int                             I; /**< \brief Signed access */
    Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES;

/** \brief  Register 79 - Transmit Frame Count for Good and Bad Unicast Frames */
typedef union
{
    unsigned int                            U; /**< \brief Unsigned access */
    signed int                              I; /**< \brief Signed access */
    Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits B; /**< \brief Bitfield access */
} Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD;

/** \brief  Register 93 - Transmit Frame Count for Good VLAN Frames */
typedef union
{
    unsigned int                     U;     /**< \brief Unsigned access */
    signed int                       I;     /**< \brief Signed access */
    Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits B;     /**< \brief Bitfield access */
} Ifx_ETH_TX_VLAN_FRAMES_GOOD;

/** \brief  Register 8 - Version Register */
typedef union
{
    unsigned int         U;                 /**< \brief Unsigned access */
    signed int           I;                 /**< \brief Signed access */
    Ifx_ETH_VERSION_Bits B;                 /**< \brief Bitfield access */
} Ifx_ETH_VERSION;

/** \brief  Register 7 - VLAN Tag Register */
typedef union
{
    unsigned int          U;                /**< \brief Unsigned access */
    signed int            I;                /**< \brief Signed access */
    Ifx_ETH_VLAN_TAG_Bits B;                /**< \brief Bitfield access */
} Ifx_ETH_VLAN_TAG;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eth_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  MAC Address */
typedef volatile struct _Ifx_ETH_MAC_ADDRESS
{
    Ifx_ETH_MAC_ADDRESS_HIGH HIGH;          /**< \brief 0, MAC Address High Register */
    Ifx_ETH_MAC_ADDRESS_LOW  LOW;           /**< \brief 4, MAC Address Low Register */
} Ifx_ETH_MAC_ADDRESS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eth_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  ETH object */
typedef volatile struct _Ifx_ETH
{
    Ifx_ETH_CLC                                      CLC;                                      /**< \brief 0, Clock Control Register */
    Ifx_ETH_ID                                       ID;                                       /**< \brief 4, Module Identification Register */
    Ifx_ETH_GPCTL                                    GPCTL;                                    /**< \brief 8, Input and Output Control Register */
    Ifx_ETH_ACCEN0                                   ACCEN0;                                   /**< \brief C, Access Enable Register 0 */
    Ifx_ETH_ACCEN1                                   ACCEN1;                                   /**< \brief 10, Access Enable Register 1 */
    Ifx_ETH_KRST0                                    KRST0;                                    /**< \brief 14, Kernel Reset Register 0 */
    Ifx_ETH_KRST1                                    KRST1;                                    /**< \brief 18, Kernel Reset Register 1 */
    Ifx_ETH_KRSTCLR                                  KRSTCLR;                                  /**< \brief 1C, Kernel Reset Status Clear Register */
    unsigned char                                    reserved_20[4064];                        /**< \brief 20, \internal Reserved */
    Ifx_ETH_MAC_CONFIGURATION                        MAC_CONFIGURATION;                        /**< \brief 1000, Register 0 - MAC Configuration Register */
    Ifx_ETH_MAC_FRAME_FILTER                         MAC_FRAME_FILTER;                         /**< \brief 1004, Register 1 - MAC Frame Filter */
    Ifx_ETH_HASH_TABLE_HIGH                          HASH_TABLE_HIGH;                          /**< \brief 1008, Register 2 - Hash Table High Register */
    Ifx_ETH_HASH_TABLE_LOW                           HASH_TABLE_LOW;                           /**< \brief 100C, Register 3 - Hash Table Low Register */
    Ifx_ETH_GMII_ADDRESS                             GMII_ADDRESS;                             /**< \brief 1010, Register 4 - GMII Address Register */
    Ifx_ETH_GMII_DATA                                GMII_DATA;                                /**< \brief 1014, Register 5 - GMII Data Register */
    Ifx_ETH_FLOW_CONTROL                             FLOW_CONTROL;                             /**< \brief 1018, Register 6 - Flow Control Register */
    Ifx_ETH_VLAN_TAG                                 VLAN_TAG;                                 /**< \brief 101C, Register 7 - VLAN Tag Register */
    Ifx_ETH_VERSION                                  VERSION;                                  /**< \brief 1020, Register 8 - Version Register */
    Ifx_ETH_DEBUG                                    DEBUG;                                    /**< \brief 1024, Register 9 - Debug Register */
    Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER              REMOTE_WAKE_UP_FRAME_FILTER;              /**< \brief 1028, Register 10 - Remote Wake-Up Frame Filter Register */
    Ifx_ETH_PMT_CONTROL_STATUS                       PMT_CONTROL_STATUS;                       /**< \brief 102C, Register 11 - PMT Control and Status Register */
    unsigned char                                    reserved_1030[8];                         /**< \brief 1030, \internal Reserved */
    Ifx_ETH_INTERRUPT_STATUS                         INTERRUPT_STATUS;                         /**< \brief 1038, Register 14 - Interrupt Register */
    Ifx_ETH_INTERRUPT_MASK                           INTERRUPT_MASK;                           /**< \brief 103C, Register 15 - Interrupt Mask Register */
    Ifx_ETH_MAC_ADDRESS                              MAC_ADDRESS_G0[16];                       /**< \brief 1040, MAC Address */
    unsigned char                                    reserved_10C0[64];                        /**< \brief 10C0, \internal Reserved */
    Ifx_ETH_MMC_CONTROL                              MMC_CONTROL;                              /**< \brief 1100, Register 64 - MMC Control Register */
    Ifx_ETH_MMC_RECEIVE_INTERRUPT                    MMC_RECEIVE_INTERRUPT;                    /**< \brief 1104, Register 65 - MMC Receive Interrupt Register */
    Ifx_ETH_MMC_TRANSMIT_INTERRUPT                   MMC_TRANSMIT_INTERRUPT;                   /**< \brief 1108, Register 66 - MMC Transmit Interrupt Register */
    Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK               MMC_RECEIVE_INTERRUPT_MASK;               /**< \brief 110C, - */
    Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK              MMC_TRANSMIT_INTERRUPT_MASK;              /**< \brief 1110, Register 68 - MMC Transmit Interrupt Mask Register */
    Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD                  TX_OCTET_COUNT_GOOD_BAD;                  /**< \brief 1114, Register 69 - Transmit Octet Count for Good and Bad Frames */
    Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD                  TX_FRAME_COUNT_GOOD_BAD;                  /**< \brief 1118, Register 70 - Transmit Frame Count for Good and Bad Frames */
    Ifx_ETH_TX_BROADCAST_FRAMES_GOOD                 TX_BROADCAST_FRAMES_GOOD;                 /**< \brief 111C, Register 71 - Transmit Frame Count for Good Broadcast Frames */
    Ifx_ETH_TX_MULTICAST_FRAMES_GOOD                 TX_MULTICAST_FRAMES_GOOD;                 /**< \brief 1120, Register 72 - Transmit Frame Count for Good Multicast Frames */
    Ifx_ETH_TX_64OCTETS_FRAMES_GOOD_BAD              TX_64OCTETS_FRAMES_GOOD_BAD;              /**< \brief 1124, Register 73 - Transmit Octet Count for Good and Bad 64 Byte Frames */
    Ifx_ETH_TX_65TO127OCTETS_FRAMES_GOOD_BAD         TX_65TO127OCTETS_FRAMES_GOOD_BAD;         /**< \brief 1128, Register 74 - Transmit Octet Count for Good and Bad 65 to 127 Bytes Frames */
    Ifx_ETH_TX_128TO255OCTETS_FRAMES_GOOD_BAD        TX_128TO255OCTETS_FRAMES_GOOD_BAD;        /**< \brief 112C, Register 75 - Transmit Octet Count for Good and Bad 128 to 255 Bytes Frames */
    Ifx_ETH_TX_256TO511OCTETS_FRAMES_GOOD_BAD        TX_256TO511OCTETS_FRAMES_GOOD_BAD;        /**< \brief 1130, Register 76 - Transmit Octet Count for Good and Bad 256 to 511 Bytes Frames */
    Ifx_ETH_TX_512TO1023OCTETS_FRAMES_GOOD_BAD       TX_512TO1023OCTETS_FRAMES_GOOD_BAD;       /**< \brief 1134, Register 77 - Transmit Octet Count for Good and Bad 512 to 1023 Bytes Frames */
    Ifx_ETH_TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD       TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;       /**< \brief 1138, Register 78 - Transmit Octet Count for Good and Bad 1024 to Maxsize Bytes Frames */
    Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD               TX_UNICAST_FRAMES_GOOD_BAD;               /**< \brief 113C, Register 79 - Transmit Frame Count for Good and Bad Unicast Frames */
    Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD             TX_MULTICAST_FRAMES_GOOD_BAD;             /**< \brief 1140, Register 80 - Transmit Frame Count for Good and Bad Multicast Frames */
    Ifx_ETH_TX_BROADCAST_FRAMES_GOOD_BAD             TX_BROADCAST_FRAMES_GOOD_BAD;             /**< \brief 1144, Register 81 - Transmit Frame Count for Good and Bad Broadcast Frames */
    Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES                TX_UNDERFLOW_ERROR_FRAMES;                /**< \brief 1148, Register 82 - Transmit Frame Count for Underflow Error Frames */
    Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES          TX_SINGLE_COLLISION_GOOD_FRAMES;          /**< \brief 114C, Register 83 - Transmit Frame Count for Frames Transmitted after Single Collision */
    Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES        TX_MULTIPLE_COLLISION_GOOD_FRAMES;        /**< \brief 1150, Register 84 - Transmit Frame Count for Frames Transmitted after Multiple Collision */
    Ifx_ETH_TX_DEFERRED_FRAMES                       TX_DEFERRED_FRAMES;                       /**< \brief 1154, Register 85 - Transmit Frame Count for Deferred Frames */
    Ifx_ETH_TX_LATE_COLLISION_FRAMES                 TX_LATE_COLLISION_FRAMES;                 /**< \brief 1158, Register 86 - Transmit Frame Count for Late Collision Error Frames */
    Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES            TX_EXCESSIVE_COLLISION_FRAMES;            /**< \brief 115C, Register 87 - Transmit Frame Count for Excessive Collision Error Frames */
    Ifx_ETH_TX_CARRIER_ERROR_FRAMES                  TX_CARRIER_ERROR_FRAMES;                  /**< \brief 1160, Register 88 - Transmit Frame Count for Carrier Sense Error Frames */
    Ifx_ETH_TX_OCTET_COUNT_GOOD                      TX_OCTET_COUNT_GOOD;                      /**< \brief 1164, Register 89 - Transmit Octet Count for Good Frames */
    Ifx_ETH_TX_FRAME_COUNT_GOOD                      TX_FRAME_COUNT_GOOD;                      /**< \brief 1168, Register 90 - Transmit Frame Count for Good Frames */
    Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR              TX_EXCESSIVE_DEFERRAL_ERROR;              /**< \brief 116C, Register 91 - Transmit Frame Count for Excessive Deferral Error Frames */
    Ifx_ETH_TX_PAUSE_FRAMES                          TX_PAUSE_FRAMES;                          /**< \brief 1170, Register 92 - Transmit Frame Count for Good PAUSE Frames */
    Ifx_ETH_TX_VLAN_FRAMES_GOOD                      TX_VLAN_FRAMES_GOOD;                      /**< \brief 1174, Register 93 - Transmit Frame Count for Good VLAN Frames */
    Ifx_ETH_TX_OSIZE_FRAMES_GOOD                     TX_OSIZE_FRAMES_GOOD;                     /**< \brief 1178, Register 94 - Transmit Frame Count for Good Oversize Frames */
    unsigned char                                    reserved_117C[4];                         /**< \brief 117C, \internal Reserved */
    Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD                 RX_FRAMES_COUNT_GOOD_BAD;                 /**< \brief 1180, Register 96 - Receive Frame Count for Good and Bad Frames */
    Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD                  RX_OCTET_COUNT_GOOD_BAD;                  /**< \brief 1184, Register 97 - Receive Octet Count for Good and Bad Frames */
    Ifx_ETH_RX_OCTET_COUNT_GOOD                      RX_OCTET_COUNT_GOOD;                      /**< \brief 1188, Register 98 - Receive Octet Count for Good Frames */
    Ifx_ETH_RX_BROADCAST_FRAMES_GOOD                 RX_BROADCAST_FRAMES_GOOD;                 /**< \brief 118C, Register 99 - Receive Frame Count for Good Broadcast Frames */
    Ifx_ETH_RX_MULTICAST_FRAMES_GOOD                 RX_MULTICAST_FRAMES_GOOD;                 /**< \brief 1190, Register 100 - Receive Frame Count for Good Multicast Frames */
    Ifx_ETH_RX_CRC_ERROR_FRAMES                      RX_CRC_ERROR_FRAMES;                      /**< \brief 1194, Register 101 - Receive Frame Count for CRC Error Frames */
    Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES                RX_ALIGNMENT_ERROR_FRAMES;                /**< \brief 1198, Register 102 - Receive Frame Count for Alignment Error Frames */
    Ifx_ETH_RX_RUNT_ERROR_FRAMES                     RX_RUNT_ERROR_FRAMES;                     /**< \brief 119C, Register 103 - Receive Frame Count for Runt Error Frames */
    Ifx_ETH_RX_JABBER_ERROR_FRAMES                   RX_JABBER_ERROR_FRAMES;                   /**< \brief 11A0, Register 104 - Receive Frame Count for Jabber Error Frames */
    Ifx_ETH_RX_UNDERSIZE_FRAMES_GOOD                 RX_UNDERSIZE_FRAMES_GOOD;                 /**< \brief 11A4, Register 105 - Receive Frame Count for Undersize Frames */
    Ifx_ETH_RX_OVERSIZE_FRAMES_GOOD                  RX_OVERSIZE_FRAMES_GOOD;                  /**< \brief 11A8, Register 106 - Receive Frame Count for Oversize Frames */
    Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD              RX_64OCTETS_FRAMES_GOOD_BAD;              /**< \brief 11AC, Register 107 - Receive Frame Count for Good and Bad 64 Byte Frames */
    Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD         RX_65TO127OCTETS_FRAMES_GOOD_BAD;         /**< \brief 11B0, Register 108 - Receive Frame Count for Good and Bad 65 to 127 Bytes Frames */
    Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD        RX_128TO255OCTETS_FRAMES_GOOD_BAD;        /**< \brief 11B4, Register 109 - Receive Frame Count for Good and Bad 128 to 255 Bytes Frames */
    Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD        RX_256TO511OCTETS_FRAMES_GOOD_BAD;        /**< \brief 11B8, Register 110 - Receive Frame Count for Good and Bad 256 to 511 Bytes Frames */
    Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD       RX_512TO1023OCTETS_FRAMES_GOOD_BAD;       /**< \brief 11BC, Register 111 - Receive Frame Count for Good and Bad 512 to 1,023 Bytes Frames */
    Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD       RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD;       /**< \brief 11C0, Register 112 - Receive Frame Count for Good and Bad 1,024 to Maxsize Bytes Frames */
    Ifx_ETH_RX_UNICAST_FRAMES_GOOD                   RX_UNICAST_FRAMES_GOOD;                   /**< \brief 11C4, Register 113 - Receive Frame Count for Good Unicast Frames */
    Ifx_ETH_RX_LENGTH_ERROR_FRAMES                   RX_LENGTH_ERROR_FRAMES;                   /**< \brief 11C8, Register 114 - Receive Frame Count for Length Error Frames */
    Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES              RX_OUT_OF_RANGE_TYPE_FRAMES;              /**< \brief 11CC, Register 115 - Receive Frame Count for Out of Range Frames */
    Ifx_ETH_RX_PAUSE_FRAMES                          RX_PAUSE_FRAMES;                          /**< \brief 11D0, Register 116 - Receive Frame Count for PAUSE Frames */
    Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES                  RX_FIFO_OVERFLOW_FRAMES;                  /**< \brief 11D4, Register 117 - Receive Frame Count for FIFO Overflow Frames */
    Ifx_ETH_RX_VLAN_FRAMES_GOOD_BAD                  RX_VLAN_FRAMES_GOOD_BAD;                  /**< \brief 11D8, Register 118 - Receive Frame Count for Good and Bad VLAN Frames */
    Ifx_ETH_RX_WATCHDOG_ERROR_FRAMES                 RX_WATCHDOG_ERROR_FRAMES;                 /**< \brief 11DC, Register 119 - Receive Frame Count for Watchdog Error Frames */
    Ifx_ETH_RX_RECEIVE_ERROR_FRAMES                  RX_RECEIVE_ERROR_FRAMES;                  /**< \brief 11E0, Register 120 - Receive Frame Count for Receive Error Frames */
    Ifx_ETH_RX_CONTROL_FRAMES_GOOD                   RX_CONTROL_FRAMES_GOOD;                   /**< \brief 11E4, Register 121 - Receive Frame Count for Good Control Frames Frames */
    unsigned char                                    reserved_11E8[24];                        /**< \brief 11E8, \internal Reserved */
    Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK           MMC_IPC_RECEIVE_INTERRUPT_MASK;           /**< \brief 1200, Register 128 - MMC Receive Checksum Offload Interrupt Mask Register */
    unsigned char                                    reserved_1204[4];                         /**< \brief 1204, \internal Reserved */
    Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT                MMC_IPC_RECEIVE_INTERRUPT;                /**< \brief 1208, Register 130 - MMC Receive Checksum Offload Interrupt Register */
    unsigned char                                    reserved_120C[4];                         /**< \brief 120C, \internal Reserved */
    Ifx_ETH_RXIPV4_GOOD_FRAMES                       RXIPV4_GOOD_FRAMES;                       /**< \brief 1210, Register 132 - Receive IPV4 Good Frame Counter Register */
    Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES               RXIPV4_HEADER_ERROR_FRAMES;               /**< \brief 1214, Register 133 - Receive IPV4 Header Error Frame Counter Register */
    Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES                 RXIPV4_NO_PAYLOAD_FRAMES;                 /**< \brief 1218, Register 134 - Receive IPV4 No Payload Frame Counter Register */
    Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES                 RXIPV4_FRAGMENTED_FRAMES;                 /**< \brief 121C, Register 135 - Receive IPV4 Fragmented Frame Counter Register */
    Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES      RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES;      /**< \brief 1220, Register 136 - Receive IPV4 UDP Checksum Disabled Frame Counter Register */
    Ifx_ETH_RXIPV6_GOOD_FRAMES                       RXIPV6_GOOD_FRAMES;                       /**< \brief 1224, Register 137 - Receive IPV6 Good Frame Counter Register */
    Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES               RXIPV6_HEADER_ERROR_FRAMES;               /**< \brief 1228, Register 138 - Receive IPV6 Header Error Frame Counter Register */
    Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES                 RXIPV6_NO_PAYLOAD_FRAMES;                 /**< \brief 122C, Register 139 - Receive IPV6 No Payload Frame Counter Register */
    Ifx_ETH_RXUDP_GOOD_FRAMES                        RXUDP_GOOD_FRAMES;                        /**< \brief 1230, Register 140 - Receive UDP Good Frame Counter Register */
    Ifx_ETH_RXUDP_ERROR_FRAMES                       RXUDP_ERROR_FRAMES;                       /**< \brief 1234, Register 141 - Receive UDP Error Frame Counter Register */
    Ifx_ETH_RXTCP_GOOD_FRAMES                        RXTCP_GOOD_FRAMES;                        /**< \brief 1238, Register 142 - Receive TCP Good Frame Counter Register */
    Ifx_ETH_RXTCP_ERROR_FRAMES                       RXTCP_ERROR_FRAMES;                       /**< \brief 123C, Register 143 - Receive TCP Error Frame Counter Register */
    Ifx_ETH_RXICMP_GOOD_FRAMES                       RXICMP_GOOD_FRAMES;                       /**< \brief 1240, Register 144 - Receive ICMP Good Frame Counter Register */
    Ifx_ETH_RXICMP_ERROR_FRAMES                      RXICMP_ERROR_FRAMES;                      /**< \brief 1244, Register 145 - Receive ICMP Error Frame Counter Register */
    unsigned char                                    reserved_1248[8];                         /**< \brief 1248, \internal Reserved */
    Ifx_ETH_RXIPV4_GOOD_OCTETS                       RXIPV4_GOOD_OCTETS;                       /**< \brief 1250, Register 148 - Receive IPV4 Good Octet Counter Register */
    Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS               RXIPV4_HEADER_ERROR_OCTETS;               /**< \brief 1254, Register 149 - Receive IPV4 Header Error Octet Counter Register */
    Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS                 RXIPV4_NO_PAYLOAD_OCTETS;                 /**< \brief 1258, Register 150 - Receive IPV4 No Payload Octet Counter Register */
    Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS                 RXIPV4_FRAGMENTED_OCTETS;                 /**< \brief 125C, Register 151 - Receive IPV4 Fragmented Octet Counter Register */
    Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS       RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS;       /**< \brief 1260, Register 152 - Receive IPV4 Fragmented Octet Counter Register */
    Ifx_ETH_RXIPV6_GOOD_OCTETS                       RXIPV6_GOOD_OCTETS;                       /**< \brief 1264, Register 153 - Receive IPV6 Good Octet Counter Register */
