Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEth_regdef.h
    Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS               RXIPV6_HEADER_ERROR_OCTETS;               /**< \brief 1268, Register 154 - Receive IPV6 Header Error Octet Counter Register */
    Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS                 RXIPV6_NO_PAYLOAD_OCTETS;                 /**< \brief 126C, Register 155 - Receive IPV6 No Payload Octet Counter Register */
    Ifx_ETH_RXUDP_GOOD_OCTETS                        RXUDP_GOOD_OCTETS;                        /**< \brief 1270, Register 156 - Receive UDP Good Octet Counter Register */
    Ifx_ETH_RXUDP_ERROR_OCTETS                       RXUDP_ERROR_OCTETS;                       /**< \brief 1274, Register 157 - Receive UDP Error Octet Counter Register */
    Ifx_ETH_RXTCP_GOOD_OCTETS                        RXTCP_GOOD_OCTETS;                        /**< \brief 1278, Register 158 - Receive TCP Good Octet Counter Register */
    Ifx_ETH_RXTCP_ERROR_OCTETS                       RXTCP_ERROR_OCTETS;                       /**< \brief 127C, Register 159 - Receive TCP Error Octet Counter Register */
    Ifx_ETH_RXICMP_GOOD_OCTETS                       RXICMP_GOOD_OCTETS;                       /**< \brief 1280, Register 160 - Receive ICMP Good Octet Counter Register */
    Ifx_ETH_RXICMP_ERROR_OCTETS                      RXICMP_ERROR_OCTETS;                      /**< \brief 1284, Register 161 - Receive ICMP Error Octet Counter Register */
    unsigned char                                    reserved_1288[1144];                      /**< \brief 1288, \internal Reserved */
    Ifx_ETH_TIMESTAMP_CONTROL                        TIMESTAMP_CONTROL;                        /**< \brief 1700, Register 448 - Timestamp Control Register */
    Ifx_ETH_SUB_SECOND_INCREMENT                     SUB_SECOND_INCREMENT;                     /**< \brief 1704, Register 449 - Sub-Second Increment Register */
    Ifx_ETH_SYSTEM_TIME_SECONDS                      SYSTEM_TIME_SECONDS;                      /**< \brief 1708, Register 450 - System Time - Seconds Register */
    Ifx_ETH_SYSTEM_TIME_NANOSECONDS                  SYSTEM_TIME_NANOSECONDS;                  /**< \brief 170C, Register 451 - System Time - Nanoseconds Register */
    Ifx_ETH_SYSTEM_TIME_SECONDS_UPDATE               SYSTEM_TIME_SECONDS_UPDATE;               /**< \brief 1710, Register 452 - System Time - Seconds Update Register */
    Ifx_ETH_SYSTEM_TIME_NANOSECONDS_UPDATE           SYSTEM_TIME_NANOSECONDS_UPDATE;           /**< \brief 1714, Register 453 - System Time - Nanoseconds Update Register */
    Ifx_ETH_TIMESTAMP_ADDEND                         TIMESTAMP_ADDEND;                         /**< \brief 1718, Register 454 - Timestamp Addend Register */
    Ifx_ETH_TARGET_TIME_SECONDS                      TARGET_TIME_SECONDS;                      /**< \brief 171C, Register 455 - Target Time Seconds Register */
    Ifx_ETH_TARGET_TIME_NANOSECONDS                  TARGET_TIME_NANOSECONDS;                  /**< \brief 1720, Register 456 - Target Time Nanoseconds Register */
    Ifx_ETH_SYSTEM_TIME_HIGHER_WORD_SECONDS          SYSTEM_TIME_HIGHER_WORD_SECONDS;          /**< \brief 1724, Register 457 - System Time - Higher Word Seconds Register */
    Ifx_ETH_TIMESTAMP_STATUS                         TIMESTAMP_STATUS;                         /**< \brief 1728, Register 458 - Timestamp Status Register */
    Ifx_ETH_PPS_CONTROL                              PPS_CONTROL;                              /**< \brief 172C, Register 459 - PPS Control Register */
    unsigned char                                    reserved_1730[208];                       /**< \brief 1730, \internal Reserved */
    Ifx_ETH_MAC_ADDRESS                              MAC_ADDRESS_G1[16];                       /**< \brief 1800, MAC Address \note Array index shifted by 16. Example: defined register MAC_ADDRESS_G1[0]/MAC_ADDRESS_G10 corresponds to user manual MAC_ADDRESS_G116, ... */
    unsigned char                                    reserved_1880[1920];                      /**< \brief 1880, \internal Reserved */
    Ifx_ETH_BUS_MODE                                 BUS_MODE;                                 /**< \brief 2000, Register 0 - Bus Mode Register */
    Ifx_ETH_TRANSMIT_POLL_DEMAND                     TRANSMIT_POLL_DEMAND;                     /**< \brief 2004, Register 1 - Transmit Poll Demand Register */
    Ifx_ETH_RECEIVE_POLL_DEMAND                      RECEIVE_POLL_DEMAND;                      /**< \brief 2008, Register 2 - Receive Poll Demand Register */
    Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS          RECEIVE_DESCRIPTOR_LIST_ADDRESS;          /**< \brief 200C, Register 3 - Receive Descriptor List Address Register */
    Ifx_ETH_TRANSMIT_DESCRIPTOR_LIST_ADDRESS         TRANSMIT_DESCRIPTOR_LIST_ADDRESS;         /**< \brief 2010, Register 4 - Transmit Descriptor List Address Register */
    Ifx_ETH_STATUS                                   STATUS;                                   /**< \brief 2014, Register 5 - Status Register */
    Ifx_ETH_OPERATION_MODE                           OPERATION_MODE;                           /**< \brief 2018, Register 6 - Operation Mode Register */
    Ifx_ETH_INTERRUPT_ENABLE                         INTERRUPT_ENABLE;                         /**< \brief 201C, Register 7 - Interrupt Enable Register */
    Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER; /**< \brief 2020, Register 8 - Missed Frame and Buffer Overflow Counter Register */
    Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER         RECEIVE_INTERRUPT_WATCHDOG_TIMER;         /**< \brief 2024, Register 9 - Receive Interrupt Watchdog Timer Register */
    unsigned char                                    reserved_2028[4];                         /**< \brief 2028, \internal Reserved */
    Ifx_ETH_AHB_OR_AXI_STATUS                        AHB_OR_AXI_STATUS;                        /**< \brief 202C, Register 11 - AHB or AXI Status Register */
    unsigned char                                    reserved_2030[24];                        /**< \brief 2030, \internal Reserved */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR         CURRENT_HOST_TRANSMIT_DESCRIPTOR;         /**< \brief 2048, Register 18 - Current Host Transmit Descriptor Register */
    Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR          CURRENT_HOST_RECEIVE_DESCRIPTOR;          /**< \brief 204C, Register 19 - Current Host Receive Descriptor Register */
    Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS     CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS;     /**< \brief 2050, Register 20 - Current Host Transmit Buffer Address Register */
    Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS      CURRENT_HOST_RECEIVE_BUFFER_ADDRESS;      /**< \brief 2054, Register 21 - Current Host Receive Buffer Address Register */
    Ifx_ETH_HW_FEATURE                               HW_FEATURE;                               /**< \brief 2058, Register 22 - HW Feature Register */
    unsigned char                                    reserved_205C[4004];                      /**< \brief 205C, \internal Reserved */
} Ifx_ETH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_REGDEF_H */
